{
  "dataset": {
    "id": "qald-6-train-multilingual"
  },
  "questions": [
    {
      "id": "131",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all Methodist politicians.",
          "keywords": "politician, Methodist"
        },
        {
          "language": "fa",
          "string": "تمام سیاستمداران متدیست را لیست کن.",
          "keywords": "سیاستمداران، متدیست"
        },
        {
          "language": "de",
          "string": "Gib mir alle Politiker, die Methodisten sind.",
          "keywords": "Politiker, Methodist"
        },
        {
          "language": "es",
          "string": "Dame todos los políticos que sean metodístas.",
          "keywords": "políticos, metodístas"
        },
        {
          "language": "it",
          "string": "Dammi tutti i politici metodisti.",
          "keywords": "politici, metodista"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les politiciens qui sont méthodistes.",
          "keywords": "politiciens, méthodistes"
        },
        {
          "language": "nl",
          "string": "Geef alle politici die methodist zijn.",
          "keywords": "politici, methodist"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți politicienii metodiști",
          "keywords": "politician, metodist"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Politician\u003e .  ?uri \u003chttp://dbpedia.org/ontology/religion\u003e \u003chttp://dbpedia.org/resource/Methodism\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT Methodist/JJ politicians/NNS ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(politicians,all) \n amod(politicians,Methodist) \n dobj(Give,politicians)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(politicians,politicians) \n REL(politicians,Methodist)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v9  ?v8 ; \n          ?v7  ?v5 . \n   } \n  \n  v9 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v7 - (rdf:Property) \n  v8 politicians (rdf:Class) \n  v5 Methodist (rdf:Resource) \n  \n Score: 0.8",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "133",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all Australian nonprofit organizations.",
          "keywords": "nonprofit organization, Australia"
        },
        {
          "language": "fa",
          "string": "تمام سازمان های ناسودبر استرالیایی را لیست کن.",
          "keywords": "سازمان های ناسودبر، استرالیایی"
        },
        {
          "language": "de",
          "string": "Gib mir alle gemeinnützigen Organisationen in Australien.",
          "keywords": "gemeinnützige Organisation, Australien"
        },
        {
          "language": "es",
          "string": "Dame todas las organizaciones benéficas de Australia.",
          "keywords": "organizaciones benéficas, Australia"
        },
        {
          "language": "it",
          "string": "Dammi tutte le organizzazioni australiane non a scopo di lucro.",
          "keywords": "organizzazioni non a scopo di lucro, Australia"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les associations australiennes à but non lucratif.",
          "keywords": "Association à but non lucratif, Australie"
        },
        {
          "language": "nl",
          "string": "Noem alle Australische organisaties zonder winstoogmerk.",
          "keywords": "organisatie zonder winstoogmerk, Australië"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate organizațiile non-profit din Australia.",
          "keywords": "organizație non-profit, Australia"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://dbpedia.org/ontology/type\u003e \u003chttp://dbpedia.org/resource/Nonprofit_organization\u003e . { ?uri \u003chttp://dbpedia.org/ontology/locationCountry\u003e \u003chttp://dbpedia.org/resource/Australia\u003e . } UNION { ?uri \u003chttp://dbpedia.org/ontology/location\u003e ?x .  ?x \u003chttp://dbpedia.org/ontology/country\u003e \u003chttp://dbpedia.org/resource/Australia\u003e . } } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT Australian/JJ nonprofit/JJ organizations/NNS ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(organizations,all) \n amod(organizations,Australian) \n amod(organizations,nonprofit) \n dobj(Give,organizations)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(organizations,organizations) \n REL(organizations,Australian) \n REL(organizations,nonprofit)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v13  ?v12 ; \n          ?v10  ?v9 ; \n          ?v11  ?v6 ; \n          ?v8   ?v5 . \n   } \n  \n  v10 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v13 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v5 Australian (rdf:Resource) \n  v12 organizations (rdf:Class) \n  v11 - (rdf:Property) \n  v9 organizations (rdf:Class) \n  v8 - (rdf:Property) \n  v6 nonprofit (rdf:Resource) \n  \n Score: 0.7777777777777778",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "140",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "List all games by GMT.",
          "keywords": "game, GMT"
        },
        {
          "language": "fa",
          "string": "تمام بازی های جی.ام.تی را لیست کن.",
          "keywords": "بازی های، جی.ام.تی"
        },
        {
          "language": "de",
          "string": "Liste alle Spiele von GMT auf.",
          "keywords": "Spiel, GMT"
        },
        {
          "language": "es",
          "string": "Dame todos los juegos de GMT.",
          "keywords": "juegos, GMT"
        },
        {
          "language": "it",
          "string": "Elenca tutti i giochi di GMT.",
          "keywords": "gioco, GMT"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les jeux de GMT.",
          "keywords": "jeux, GMT"
        },
        {
          "language": "nl",
          "string": "Noem alle spelen van GMT.",
          "keywords": "spel, GMT"
        },
        {
          "language": "ro",
          "string": "Enumeră toate jocurile de GMT",
          "keywords": "joc, GMT"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://dbpedia.org/ontology/publisher\u003e \u003chttp://dbpedia.org/resource/GMT_Games\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "List/VB all/DT games/NNS by/IN GMT/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "det(games,all) \n dobj(List,games) \n prep(List,by) \n pobj(by,GMT)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "List(games,GMT)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "ASK \n WHERE \n   { ?v2  ?v9  ?v8 ; \n          ?v7  ?v5 . \n   } \n  \n  v9 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v5 GMT (rdf:Resource) \n  v7 List (rdf:Property) \n  v8 games (rdf:Class) \n  \n Score: 0.8",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "143",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all breeds of the German Shepherd dog.",
          "keywords": "breed, German Shepherd dog"
        },
        {
          "language": "fa",
          "string": "تمام گونه های سگ ژرمن شپرد را لیست کن.",
          "keywords": "گونه، سگ ژرمن شپرد"
        },
        {
          "language": "de",
          "string": "Gib mir alle Schäferhundrassen.",
          "keywords": "Schäferhundrasse"
        },
        {
          "language": "es",
          "string": "Dame todas las razas de pastor alemán.",
          "keywords": "razas de pastor alemán"
        },
        {
          "language": "it",
          "string": "Dammi tutte le razze del pastore tedesco.",
          "keywords": "razza, pastore tedesco"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les races de bergers allemands.",
          "keywords": "races, bergers allemands"
        },
        {
          "language": "nl",
          "string": "Noem alle soorten Duitse herders.",
          "keywords": "Duitse herder, soort"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate rasele câinelui Ciobănesc German.",
          "keywords": "rasă, câine Ciobănesc German"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://dbpedia.org/property/breed\u003e \u003chttp://dbpedia.org/resource/German_Shepherd\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT breeds/NNS of/IN the/DT German/JJ Shepherd/NNP dog/NN ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(breeds,all) \n dobj(Give,breeds) \n prep(breeds,of) \n det(dog,the) \n amod(dog,German) \n nn(dog,Shepherd) \n pobj(of,dog)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(breeds,breeds) \n ARGP(breeds,Shepherd dog) \n REL(Shepherd dog,German)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v6  ?v17  ?v16 . \n     ?v3  ?v12  ?v11 . \n     ?v6  ?v14  ?v13 . \n     ?v3  ?v10  ?v6 . \n     ?v6  ?v15  ?v8 . \n   } \n  \n  v14 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v10 ARGP (rdf:Property) \n  v16 Shepherd dog (rdf:Class) \n  v12 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v11 breeds (rdf:Class) \n  v8 German (rdf:Resource) \n  v15 - (rdf:Property) \n  v13 Shepherd dog (rdf:Class) \n  v17 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  \n Score: 0.8181818181818182",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "151",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all islands that belong to Japan.",
          "keywords": "islands, Japan"
        },
        {
          "language": "fa",
          "string": "تمام جزایر متعلق به ژاپن را لیست کن.",
          "keywords": "جزایر، ژاپن"
        },
        {
          "language": "de",
          "string": "Gib mir alle Inseln, die zu Japan gehören.",
          "keywords": "Inseln, Japan"
        },
        {
          "language": "es",
          "string": "Dame todas la islas que pertenezcan a Japón.",
          "keywords": "islias, Japón"
        },
        {
          "language": "it",
          "string": "Dammi tutte le isole che appartengono al Giappone.",
          "keywords": "isole, Giappone"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les îles qui appartiennent aux Japon.",
          "keywords": "îles, Japon"
        },
        {
          "language": "nl",
          "string": "Geef alle eilanden die behoren tot Japan.",
          "keywords": "eilanden, Japan"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate insulele care aparțin Japoniei.",
          "keywords": "insule, Japonia"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Island\u003e .  ?uri \u003chttp://dbpedia.org/ontology/country\u003e \u003chttp://dbpedia.org/resource/Japan\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT islands/NNS that/WDT belong/VBP to/TO Japan/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(islands,all) \n dobj(Give,islands) \n nsubj(belong,that) \n rcmod(islands,belong) \n prep(belong,to) \n pobj(to,Japan)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARG0(islands,belong) \n SELECT(islands,islands) \n belong(THIS,Japan)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v6  ?v17  ?v16 . \n     ?v3  ?v12  ?v11 ; \n          ?v10  ?v5 . \n     ?v5  ?v14  ?v13 . \n     ?v6  ?v15  ?v8 . \n   } \n  \n  v12 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v14 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v15 belong (rdf:Property) \n  v8 Japan (rdf:Resource) \n  v11 islands (rdf:Class) \n  v10 ARG0 (rdf:Property) \n  v17 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v13 belong (rdf:Class) \n  v16 THIS (rdf:Class) \n  \n Score: 0.8333333333333334",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "16",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me the capitals of all countries in Africa.",
          "keywords": "Africa, country, capital"
        },
        {
          "language": "fa",
          "string": "پایتخت تمام کشورهای آفریقا را لیست کن.",
          "keywords": "پایتخت، کشورهای، آفریقا"
        },
        {
          "language": "de",
          "string": "Gib mir die Haupstädte von allen Ländern in Afrika.",
          "keywords": "Afrika, Land, Hauptstadt"
        },
        {
          "language": "es",
          "string": "Dame las capitales de todos los países africanos.",
          "keywords": "países, africanos, capital"
        },
        {
          "language": "it",
          "string": "Dammi le capitali di tutti gli stati dell\u0027Africa.",
          "keywords": "Africa, stato, capitale"
        },
        {
          "language": "fr",
          "string": "Donnes-moi la capitale de chaque pays d\u0027Afrique.",
          "keywords": "capitale, pays, Afrique"
        },
        {
          "language": "nl",
          "string": "Noem de hoofdsteden van alle landen in Afrika.",
          "keywords": "Africa, land, hoof"
        },
        {
          "language": "ro",
          "string": "Dă-mi capitalele tuturor țărilor din Africa.",
          "keywords": "Africa, țară, capitală"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?states \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/class/yago/AfricanCountries\u003e .  ?states \u003chttp://dbpedia.org/ontology/capital\u003e ?uri . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP the/DT capitals/NNS of/IN all/DT countries/NNS in/IN Africa/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(capitals,the) \n dobj(Give,capitals) \n prep(capitals,of) \n det(countries,all) \n pobj(of,countries) \n prep(countries,in) \n pobj(in,Africa)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(capitals,capitals) \n ARGP(capitals,countries) \n ARGP(countries,Africa)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v13  ?v12 . \n     ?v6  ?v18  ?v17 ; \n          ?v15  ?v14 ; \n          ?v16  ?v9 . \n     ?v3  ?v11  ?v6 . \n   } \n  \n  v15 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v17 countries (rdf:Class) \n  v16 ARGP (rdf:Property) \n  v9 Africa (rdf:Resource) \n  v12 capitals (rdf:Class) \n  v14 countries (rdf:Class) \n  v11 ARGP (rdf:Property) \n  v13 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v18 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  \n Score: 0.9090909090909091",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "160",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me a list of all lakes in Denmark.",
          "keywords": "lake, Denmark"
        },
        {
          "language": "fa",
          "string": "تمام دریاچه های دانمارک را لیست کن.",
          "keywords": "دریاچه های، دانمارک"
        },
        {
          "language": "de",
          "string": "Gib mir eine Liste aller Seen in Dänemark.",
          "keywords": "See, Dänemark"
        },
        {
          "language": "es",
          "string": "Dame una lista de todos los lagos en Dinamarca.",
          "keywords": "lista, lagos, Dinamarca"
        },
        {
          "language": "it",
          "string": "Dammi una lista di tutti i laghi della Danimarca.",
          "keywords": "lago, Danimarca"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les lacs du Danemark.",
          "keywords": "lacs, Danemark"
        },
        {
          "language": "nl",
          "string": "Noem alle meren in Denemarken.",
          "keywords": "meer, Denemarken"
        },
        {
          "language": "ro",
          "string": "Dă-mi o listă a tuturor lacurilor din Danemarca.",
          "keywords": "lac, Danemarca"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  { ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Lake\u003e .  ?uri \u003chttp://dbpedia.org/ontology/country\u003e \u003chttp://dbpedia.org/resource/Denmark\u003e . }  UNION  { ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/class/yago/LakesOfDenmark\u003e . } } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP a/DT list/NN of/IN all/DT lakes/NNS in/IN Denmark/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(list,a) \n dobj(Give,list) \n prep(list,of) \n det(lakes,all) \n pobj(of,lakes) \n prep(lakes,in) \n pobj(in,Denmark)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(list,list) \n ARGP(list,lakes) \n ARGP(lakes,Denmark)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v13  ?v12 . \n     ?v6  ?v18  ?v17 ; \n          ?v15  ?v14 ; \n          ?v16  ?v9 . \n     ?v3  ?v11  ?v6 . \n   } \n  \n  v17 lakes (rdf:Class) \n  v16 ARGP (rdf:Property) \n  v13 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v9 Denmark (rdf:Resource) \n  v12 list (rdf:Class) \n  v11 ARGP (rdf:Property) \n  v18 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v14 lakes (rdf:Class) \n  v15 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  \n Score: 0.9090909090909091",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "163",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all Danish movies.",
          "keywords": "movie, Denmark"
        },
        {
          "language": "fa",
          "string": "تمام فیلم های دانمارکی را لیست کن.",
          "keywords": "فیلم های، دانمارکی"
        },
        {
          "language": "de",
          "string": "Gib mir alle dänischen Filme.",
          "keywords": "Film, Dänemark"
        },
        {
          "language": "es",
          "string": "Dame todas las películas danesas.",
          "keywords": "película, Dinamarca"
        },
        {
          "language": "it",
          "string": "Dammi tutti i film danesi.",
          "keywords": "film, Danimarca"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les films danois.",
          "keywords": "films, Danemark"
        },
        {
          "language": "nl",
          "string": "Noem alle Deense films.",
          "keywords": "film, Denemarken"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate filmele daneze.",
          "keywords": "film, Danemarca"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Film\u003e .  ?uri \u003chttp://dbpedia.org/ontology/country\u003e \u003chttp://dbpedia.org/resource/Denmark\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT Danish/JJ movies/NNS ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(movies,all) \n amod(movies,Danish) \n dobj(Give,movies)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(movies,movies) \n REL(movies,Danish)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v9  ?v8 ; \n          ?v7  ?v5 . \n   } \n  \n  v8 movies (rdf:Class) \n  v5 Danish (rdf:Resource) \n  v7 - (rdf:Property) \n  v9 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  \n Score: 0.8",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "164",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all launch pads operated by NASA.",
          "keywords": "launch pad, operate, NASA"
        },
        {
          "language": "fa",
          "string": "تمام سکوهای پرتاب راه اندازی شده توسط ناسا را لیست کن.",
          "keywords": "سکوهای پرتاب، راه اندازی شده، ناسا"
        },
        {
          "language": "de",
          "string": "Gib mir alle von der NASA betriebenen Startrampen.",
          "keywords": "Startrampe, betreiben, NASA"
        },
        {
          "language": "es",
          "string": "Dame todas las plataformas de lanzamiento operadas por la NASA.",
          "keywords": "plataforma de lanzamiento, operada por la NASA"
        },
        {
          "language": "it",
          "string": "Dammi tutte le rampe di lancio gestite dalla NASA.",
          "keywords": "rampa di lancio, gestire, NASA"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les rampes de lancements des Etats-unis.",
          "keywords": "rampes de lancements, Etats-unis"
        },
        {
          "language": "nl",
          "string": "Noem alle lanceerplatformen van de NASA.",
          "keywords": "lanceerplatform, NASA"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate rampele de lansare operate de către NASA.",
          "keywords": "rampă de lansare, operat, NASA"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/LaunchPad\u003e .  ?uri \u003chttp://dbpedia.org/ontology/operator\u003e \u003chttp://dbpedia.org/resource/NASA\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT launch/NN pads/NNS operated/VBN by/IN NASA/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(pads,all) \n nn(pads,launch) \n dobj(Give,pads) \n vmod(pads,operated) \n prep(operated,by) \n pobj(by,NASA)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(launch pads,launch pads) \n ARGP(operated,NASA)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v6  ?v10  ?v8 ; \n          ?v12  ?v11 . \n     ?v3  ?v14  ?v13 . \n   } \n  \n  v13 launch pads (rdf:Class) \n  v11 operated (rdf:Class) \n  v8 NASA (rdf:Resource) \n  v14 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v12 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v10 ARGP (rdf:Property) \n  \n Score: 0.875",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "17",
      "answertype": "resource",
      "aggregation": "true",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all cities in New Jersey with more than 100000 inhabitants.",
          "keywords": "New Jersey, city, inhabitants, more than 100000"
        },
        {
          "language": "fa",
          "string": "تمام شهرهای نیوجرسی که بیشتر از 100000 سکنه دارند را لیست کن.",
          "keywords": "شهرهای، نیوجرسی، بیشتر از 100000، سکنه"
        },
        {
          "language": "de",
          "string": "Gib mir alle Städte in New Jersey, die mehr als 100000 Einwohner haben.",
          "keywords": "New Jersey, Stadt, Einwohner, mehr als 100000"
        },
        {
          "language": "es",
          "string": "Dame todas las cuidades en New Jersey que tengan más de 100000 habitantes.",
          "keywords": "New Jersey, ciudad, habitantes, más de 100000"
        },
        {
          "language": "it",
          "string": "Dammi tutte le città del New Jersey con più di 100000 abitanti.",
          "keywords": "New Jersey, città, abitanti, più di 100000"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les villes du New Jersey avec plus de 100000 habitants.",
          "keywords": "New Jersey, villes, habitants, plus de 100000"
        },
        {
          "language": "nl",
          "string": "Geef alle steden in New Jersey met meer dan 100000 inwoners.",
          "keywords": "New Jersey, stad, inwoners, meer dan 100000"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate orașele din New Jersey cu mai mult de 100000 de locuitori.",
          "keywords": "New Jersey, oraș, locuitori, mai mult de 100000"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/City\u003e .  ?uri \u003chttp://dbpedia.org/ontology/isPartOf\u003e \u003chttp://dbpedia.org/resource/New_Jersey\u003e .  ?uri \u003chttp://dbpedia.org/ontology/populationTotal\u003e ?inhabitants .  FILTER (?inhabitants \u003e 100000) . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT cities/NNS in/IN New/NNP Jersey/NNP with/IN more/JJR than/IN 100000/CD inhabitants/NNS ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(cities,all) \n dobj(Give,cities) \n prep(cities,in) \n nn(Jersey,New) \n pobj(in,Jersey) \n prep(Jersey,with) \n mwe(than,more) \n quantmod(100000,than) \n num(inhabitants,100000) \n pobj(with,inhabitants)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(cities,cities) \n ARGP(cities,New Jersey) \n ARGP(New Jersey,inhabitants)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v12  ?v19  ?v18 . \n     ?v3   ?v16  ?v15 ; \n           ?v14  ?v6 . \n     ?v6   ?v17  ?v12 . \n   } \n  \n  v15 cities (rdf:Class) \n  v16 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v18 inhabitants (rdf:Class) \n  v17 ARGP (rdf:Property) \n  v14 ARGP (rdf:Property) \n  v6 New Jersey (rdf:Resource) \n  v19 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  \n Score: 0.8888888888888888",
          "creator": "rocknrole"
        }
      ]
    }
  ]
}