{
  "dataset": {
    "id": "qald-6-train-multilingual"
  },
  "questions": [
    {
      "id": "1",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all cosmonauts.",
          "keywords": "cosmonauts"
        },
        {
          "language": "fa",
          "string": "تمام فضانوردان روس را لیست کن.",
          "keywords": "فضانوردان، روس"
        },
        {
          "language": "de",
          "string": "Gib mir alle Kosmonauten.",
          "keywords": "Kosmonauten"
        },
        {
          "language": "es",
          "string": "Dame todas las cosmonautas.",
          "keywords": "cosmonautas"
        },
        {
          "language": "it",
          "string": "Dammi tutte le cosmonaute.",
          "keywords": "cosmonaute"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les cosmonautes.",
          "keywords": "cosmonautes"
        },
        {
          "language": "nl",
          "string": "Geef alle kosmonauten.",
          "keywords": "kosmonauten"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți cosmonauții.",
          "keywords": "cosmonauți"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Astronaut\u003e . { ?uri \u003chttp://dbpedia.org/ontology/nationality\u003e \u003chttp://dbpedia.org/resource/Russia\u003e . } UNION { ?uri \u003chttp://dbpedia.org/ontology/nationality\u003e \u003chttp://dbpedia.org/resource/Soviet_Union\u003e . } } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT cosmonauts/NNS ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(cosmonauts,all) \n dobj(Give,cosmonauts)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(cosmonauts,cosmonauts)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v6  ?v5 .} \n  \n  v6 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v5 cosmonauts (rdf:Class) \n  \n Score: 1.0",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "106",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all professional skateboarders from Sweden.",
          "keywords": "professional, skateboarder, Sweden"
        },
        {
          "language": "fa",
          "string": "تمام اسکیت بازهای حرفه ای اهل سوئد را لیست کن.",
          "keywords": "اسکیت باز، حرفه ای، سوئد"
        },
        {
          "language": "de",
          "string": "Gib mir alle Profiskateboarder aus Schweden.",
          "keywords": "Profiskateboarder, Schweden"
        },
        {
          "language": "es",
          "string": "Dame todos las skateboarders profesionales de Suecia.",
          "keywords": "skateboarder profesional, Suecia"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli skateboarders professionisti della Svezia.",
          "keywords": "skateboarders professionisti, Svezia"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les skateboarders professionnels de Suède.",
          "keywords": "skateboarders professionnels, Suède"
        },
        {
          "language": "nl",
          "string": "Noem alle professionele skateboarders uit Zweden.",
          "keywords": "skateboarder, professioneel, Zweden"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți skateboarderii profesioniști din Suedia.",
          "keywords": "profesionist, skateboarder, Suedia"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://dbpedia.org/ontology/occupation\u003e \u003chttp://dbpedia.org/resource/Skateboarding\u003e . { ?uri \u003chttp://dbpedia.org/ontology/birthPlace\u003e \u003chttp://dbpedia.org/resource/Sweden\u003e . } UNION { ?uri \u003chttp://dbpedia.org/ontology/birthPlace\u003e ?place .  ?place \u003chttp://dbpedia.org/ontology/country\u003e \u003chttp://dbpedia.org/resource/Sweden\u003e . } } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT professional/JJ skateboarders/NNS from/IN Sweden/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(skateboarders,all) \n amod(skateboarders,professional) \n dobj(Give,skateboarders) \n prep(skateboarders,from) \n pobj(from,Sweden)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(skateboarders,skateboarders) \n ARGP(skateboarders,Sweden) \n REL(skateboarders,professional)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v9   ?v7 ; \n          ?v11  ?v10 ; \n          ?v14  ?v13 ; \n          ?v12  ?v5 . \n   } \n  \n  v10 skateboarders (rdf:Class) \n  v7 Sweden (rdf:Resource) \n  v14 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v11 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v12 - (rdf:Property) \n  v9 ARGP (rdf:Property) \n  v13 skateboarders (rdf:Class) \n  v5 professional (rdf:Resource) \n  \n Score: 0.8888888888888888",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "109",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me a list of all bandleaders that play trumpet.",
          "keywords": "bandleader, play, trumpet"
        },
        {
          "language": "fa",
          "string": "تمام رهبران گروه که ترومپت می نوازند را لیست کن.",
          "keywords": "رهبران گروه، ترومپت، می نوازند"
        },
        {
          "language": "de",
          "string": "Gib mir eine Liste aller Bandleader, die Trompete spielen.",
          "keywords": "Bandleader, spielen, Trompete"
        },
        {
          "language": "es",
          "string": "Dame una lista de todos los líderes de un grupo que tocan la trompeta.",
          "keywords": "líder de grupo, tocar, trompeta"
        },
        {
          "language": "it",
          "string": "Dammi la lista di tutti i direttori di orchestra che suonano la tromba.",
          "keywords": "direttori di orchestra, suonare, tromba"
        },
        {
          "language": "fr",
          "string": "Donne-moi une liste de tous les chefs d\u0027orchestre qui jouent trompette.",
          "keywords": "chef d\u0027orchestre, jouer, trompette"
        },
        {
          "language": "nl",
          "string": "Geef me een lijst van alle bandleider die trompet spelen.",
          "keywords": "bandleider, spelen, trompet"
        },
        {
          "language": "ro",
          "string": "Dă-mi o listă a tuturor conducătorilor de formații care cântă la trompetă.",
          "keywords": "conducător de formație, cântă, trompetă"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://dbpedia.org/ontology/occupation\u003e \u003chttp://dbpedia.org/resource/Bandleader\u003e .  ?uri \u003chttp://dbpedia.org/ontology/instrument\u003e \u003chttp://dbpedia.org/resource/Trumpet\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP a/DT list/NN of/IN all/DT bandleaders/NNS that/WDT play/VBP trumpet/NN ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(list,a) \n dobj(Give,list) \n prep(list,of) \n det(bandleaders,all) \n pobj(of,bandleaders) \n nsubj(play,that) \n rcmod(bandleaders,play) \n dobj(play,trumpet)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARG0(bandleaders,play) \n SELECT(list,list) \n ARGP(list,bandleaders) \n play(THIS,trumpet)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v6   ?v12  ?v8 . \n     ?v3   ?v17  ?v6 . \n     ?v9   ?v22  ?v10 . \n     ?v6   ?v21  ?v20 . \n     ?v8   ?v16  ?v15 . \n     ?v10  ?v26  ?v25 . \n     ?v6   ?v14  ?v13 . \n     ?v9   ?v24  ?v23 . \n     ?v3   ?v19  ?v18 . \n   } \n  \n  v26 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v24 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v15 play (rdf:Class) \n  v17 ARGP (rdf:Property) \n  v20 bandleaders (rdf:Class) \n  v12 ARG0 (rdf:Property) \n  v16 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v23 THIS (rdf:Class) \n  v13 bandleaders (rdf:Class) \n  v25 trumpet (rdf:Class) \n  v22 play (rdf:Property) \n  v21 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v14 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v19 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v18 list (rdf:Class) \n  \n Score: 0.8",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "114",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all members of Prodigy.",
          "keywords": "member, Prodigy"
        },
        {
          "language": "fa",
          "string": "تمام اعضای پرادیجی را لیست کن.",
          "keywords": "اعضا، پرادیجی"
        },
        {
          "language": "de",
          "string": "Gib mir alle Bandmitglieder von Prodigy.",
          "keywords": "Bandmitglied, Prodigy"
        },
        {
          "language": "es",
          "string": "Dame todos los miembros de la banda Prodigy.",
          "keywords": "miembros de la banda Prodigy"
        },
        {
          "language": "it",
          "string": "Dammi tutti i membri dei Prodigy.",
          "keywords": "membri, Prodigy"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les membres de Prodigy.",
          "keywords": "members, Prodigy"
        },
        {
          "language": "nl",
          "string": "Noem alle leden van Prodigy.",
          "keywords": "leden, Prodigy"
        },
        {
          "language": "ro",
          "string": "Dă-mi toții membrii Prodigy.",
          "keywords": "membru, Prodigy"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  \u003chttp://dbpedia.org/resource/The_Prodigy\u003e \u003chttp://dbpedia.org/ontology/bandMember\u003e ?uri . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT members/NNS of/IN Prodigy/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(members,all) \n dobj(Give,members) \n prep(members,of) \n pobj(of,Prodigy)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(members,members) \n ARGP(members,Prodigy)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v10  ?v9 ; \n          ?v8   ?v6 . \n   } \n  \n  v10 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v9 members (rdf:Class) \n  v6 Prodigy (rdf:Resource) \n  v8 ARGP (rdf:Property) \n  \n Score: 1.0",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "117",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all cars that are produced in Germany.",
          "keywords": "car, produce, Germany"
        },
        {
          "language": "fa",
          "string": "تمام خودروهایی که در آلمان تولید می شوند را لیست کن.",
          "keywords": "خودرو، آلمان، تولید"
        },
        {
          "language": "de",
          "string": "Gib mir alle Autos, die in Deutschland hergestellt werden.",
          "keywords": "Auto, herstellen, Deutschland"
        },
        {
          "language": "es",
          "string": "Dame todos los coches producidos en Alemania.",
          "keywords": "coches, producidos, Alemania"
        },
        {
          "language": "it",
          "string": "Dammi tutte le automobili che sono prodotte in Germania.",
          "keywords": "automobile, produrre, Germania"
        },
        {
          "language": "fr",
          "string": "Donne-moi toutes les voitures qui sont produites en Allemagne.",
          "keywords": "voiture, produites, Allemagne"
        },
        {
          "language": "nl",
          "string": "Geef alle auto\u0027s die in Duitsland gemaakt worden.",
          "keywords": "auto, gemaakt, Duitsland"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate mașinile care sunt produse în Germania.",
          "keywords": "mașină, produse, Germania"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Automobile\u003e . { ?uri \u003chttp://dbpedia.org/ontology/assembly\u003e \u003chttp://dbpedia.org/resource/Germany\u003e . } UNION { ?uri \u003chttp://dbpedia.org/property/assembly\u003e \u003chttp://dbpedia.org/resource/Germany\u003e . } UNION { { ?uri \u003chttp://dbpedia.org/ontology/manufacturer\u003e ?x . }  UNION  { ?uri \u003chttp://dbpedia.org/property/manufacturer\u003e ?x . }  { ?x \u003chttp://dbpedia.org/ontology/locationCountry\u003e \u003chttp://dbpedia.org/resource/Germany\u003e . }  UNION  { ?x \u003chttp://dbpedia.org/ontology/location\u003e \u003chttp://dbpedia.org/resource/Germany\u003e . } } } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT cars/NNS that/WDT are/VBP produced/VBN in/IN Germany/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(cars,all) \n dobj(Give,cars) \n nsubjpass(produced,that) \n auxpass(produced,are) \n rcmod(cars,produced) \n prep(produced,in) \n pobj(in,Germany)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARG0(cars,produced) \n SELECT(cars,cars) \n produced(THIS,Germany)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v13  ?v12 . \n     ?v6  ?v18  ?v17 . \n     ?v5  ?v15  ?v14 . \n     ?v6  ?v16  ?v9 . \n     ?v3  ?v11  ?v5 . \n   } \n  \n  v18 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v13 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v15 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v12 cars (rdf:Class) \n  v16 produced (rdf:Property) \n  v14 produced (rdf:Class) \n  v17 THIS (rdf:Class) \n  v11 ARG0 (rdf:Property) \n  v9 Germany (rdf:Resource) \n  \n Score: 0.8333333333333334",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "118",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "What were the main discoveries of the Mars rover Curiosity?",
          "keywords": "Mars rover Curiosity, main discoveries"
        },
        {
          "language": "fa",
          "string": "مهم ترین کشف های مریخ نورد کوریوسیتی چه بود؟",
          "keywords": "کشف، مریخ نورد کوریوسیتی"
        },
        {
          "language": "de",
          "string": "Was waren die wichtigsten Entdeckungen des Marsrovers Curiosity?",
          "keywords": "Marsrover Curiosity, wichtigste Entdeckungen"
        },
        {
          "language": "es",
          "string": "¿Cuáles fueron los principales descubrimientos de Mars rover Curiosity?",
          "keywords": "Mars rover Curiosity, principales descubrimientos"
        },
        {
          "language": "it",
          "string": "Quali sono state le scoperte piu\u0027 importanti del Mars rover Curiosity?",
          "keywords": "Mars rover Curiosity, scoperte piu\u0027 importanti"
        },
        {
          "language": "fr",
          "string": "Quelles sont les découvertes les plus importantes du Mars Rover Curiosity?",
          "keywords": "Mars Rover Curiosity, découvertes importantes"
        },
        {
          "language": "nl",
          "string": "Wat zijn de meest belangrijke ontdekkingen van de Mars rover Curiosity?",
          "keywords": "Mars rover Curiosity, meest belangrijke ontdekkingen"
        },
        {
          "language": "ro",
          "string": "Care au fost descoperirile principale ale Mars rover Curiosity?",
          "keywords": "Mars rover Curiosity, descoperiri principale"
        }
      ],
      "query": {},
      "annotations": [
        {
          "type": "POS",
          "value": "What/WP were/VBD the/DT main/JJ discoveries/NNS of/IN the/DT Mars/NNP rover/NN Curiosity/NN ?/. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "cop(What,were) \n det(discoveries,the) \n amod(discoveries,main) \n nsubj(What,discoveries) \n prep(discoveries,of) \n det(Curiosity,the) \n nn(Curiosity,Mars) \n nn(Curiosity,rover) \n pobj(of,Curiosity)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARGP(discoveries,rover Mars Curiosity) \n EQUALS(THING,discoveries) \n REL(discoveries,main)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "ASK \n WHERE \n   { ?v3  ?v9                   ?v7 ; \n          ?v15                  ?v5 . \n     ?v1  \u003chttp://www.w3.org/2002/07/owl#sameAs\u003e  ?v3 . \n     ?v3  ?v17                  ?v16 ; \n          ?v11                  ?v10 . \n     ?v7  ?v13                  ?v12 . \n   } \n  \n  v10 discoveries (rdf:Class) \n  v16 discoveries (rdf:Class) \n  v15 - (rdf:Property) \n  v17 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v12 rover Mars Curiosity (rdf:Class) \n  v11 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v13 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v5 main (rdf:Resource) \n  v9 ARGP (rdf:Property) \n  \n Score: 0.6666666666666666",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "119",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all people that were born in Vienna and died in Berlin.",
          "keywords": "people, born, Vienna, die, Berlin"
        },
        {
          "language": "fa",
          "string": "تمام افرادی که در وین متولد شدند و در برلین مردند را لیست کن.",
          "keywords": "افرادی، متولد، وین، برلین، مردند"
        },
        {
          "language": "de",
          "string": "Gib mir alle Personen, die in Wien geboren wurden und in Berlin gestorben sind.",
          "keywords": "Person, geboren, Wien, gestorben, Berlin"
        },
        {
          "language": "es",
          "string": "Dame todas las personas que hayan nacido en Viena y hayan muerto en Berlin.",
          "keywords": "personas, nacidas en Viena, muertas en Berlin"
        },
        {
          "language": "it",
          "string": "Dammi tutte le persone che sono nate a Vienna e morte a Berlino.",
          "keywords": "persona, nata, Vienna, morta, Berlino"
        },
        {
          "language": "fr",
          "string": "Donne-moi toutes les personnes qui sont nées à Vienne et mortes à Berlin.",
          "keywords": "personnes, nées, Vienne, mortes, Berlin"
        },
        {
          "language": "nl",
          "string": "Noem alle personen die geboren zijn in Wenen en gestorven zijn in Berlijn.",
          "keywords": "persoon, geboren, Wenen, gestorven, Berlijn"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți oamenii care s-au născut în Viena și au murit în Berlin.",
          "keywords": "oameni, născut, Viena, murit, Berlin"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://dbpedia.org/ontology/birthPlace\u003e \u003chttp://dbpedia.org/resource/Vienna\u003e .  ?uri \u003chttp://dbpedia.org/ontology/deathPlace\u003e \u003chttp://dbpedia.org/resource/Berlin\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT people/NNS that/WDT were/VBD born/VBN in/IN Vienna/NNP and/CC died/VBD in/IN Berlin/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(people,all) \n dobj(Give,people) \n nsubjpass(born,that) \n auxpass(born,were) \n rcmod(people,born) \n prep(born,in) \n pobj(in,Vienna) \n cc(Give,and) \n conj(Give,died) \n prep(died,in) \n pobj(in,Berlin)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARG0(people,born) \n SELECT(people,people) \n ARGP(died,Berlin) \n born(THIS,Vienna) \n conjunct(and,Give) \n conjunct(and,died)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3   ?v15  ?v5 . \n     ?v1   ?v30  ?v29 . \n     ?v3   ?v17  ?v16 . \n     ?v6   ?v23  ?v9 . \n     ?v10  ?v26  ?v1 . \n     ?v11  ?v20  ?v13 ; \n           ?v22  ?v21 . \n     ?v10  ?v28  ?v27 . \n     ?v6   ?v25  ?v24 . \n     ?v5   ?v19  ?v18 . \n     ?v11  ?v35  ?v34 . \n     ?v10  ?v33  ?v32 ; \n           ?v31  ?v11 . \n   } \n  \n  v15 ARG0 (rdf:Property) \n  v13 Berlin (rdf:Resource) \n  v22 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v25 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v23 born (rdf:Property) \n  v35 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v33 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v30 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v19 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v9 Vienna (rdf:Resource) \n  v32 and (rdf:Class) \n  v29 Give (rdf:Class) \n  v17 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v18 born (rdf:Class) \n  v31 conjunct (rdf:Property) \n  v16 people (rdf:Class) \n  v24 THIS (rdf:Class) \n  v34 died (rdf:Class) \n  v20 ARGP (rdf:Property) \n  v21 died (rdf:Class) \n  v28 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v26 conjunct (rdf:Property) \n  v27 and (rdf:Class) \n  \n Score: 0.8275862068965517",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "128",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all movies directed by Francis Ford Coppola.",
          "keywords": "movie, direct, Francis Ford Coppola"
        },
        {
          "language": "fa",
          "string": "تمام فیلم های کارگردانی شده توسط فرانسیس فورد کوپولا را لیست کن.",
          "keywords": "فیلم، کارگردانی، فرانسیس فورد کوپولا"
        },
        {
          "language": "de",
          "string": "Gib mir alle Filme, bei denen Francis Ford Coppola Regie geführt hat.",
          "keywords": "Film, Regie, Francis Ford Coppola"
        },
        {
          "language": "es",
          "string": "Dame todas las películas que haya dirigido Francis Ford Coppola.",
          "keywords": "película, director, Francis Ford Coppola"
        },
        {
          "language": "it",
          "string": "Dammi tutti i film diretti da Francis Ford Coppola.",
          "keywords": "film, dirigere, Francis Ford Coppola"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les films dont Francis réalisés par Francis Ford Coppola.",
          "keywords": "film, directeur, Francis Ford Coppola"
        },
        {
          "language": "nl",
          "string": "Geef alle films die werden geregisseerd door Francis Ford Coppola.",
          "keywords": "films, regisseur, Francis Ford Coppola"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate filmele regizate de Francis Ford Coppola.",
          "keywords": "film, regizat, Francis Ford Coppola"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Film\u003e .  ?uri \u003chttp://dbpedia.org/ontology/director\u003e \u003chttp://dbpedia.org/resource/Francis_Ford_Coppola\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT movies/NNS directed/VBN by/IN Francis/NNP Ford/NNP Coppola/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(movies,all) \n dobj(Give,movies) \n vmod(movies,directed) \n prep(directed,by) \n nn(Coppola,Francis) \n nn(Coppola,Ford) \n pobj(by,Coppola)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(movies,movies) \n ARGP(directed,Ford Francis Coppola)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v5  ?v9   ?v7 . \n     ?v3  ?v13  ?v12 . \n     ?v5  ?v11  ?v10 . \n   } \n  \n  v10 directed (rdf:Class) \n  v7 Ford Francis Coppola (rdf:Resource) \n  v9 ARGP (rdf:Property) \n  v12 movies (rdf:Class) \n  v11 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v13 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  \n Score: 0.875",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "129",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all actors starring in movies directed by William Shatner.",
          "keywords": "actor, starring, movie, direct, William Shatner"
        },
        {
          "language": "fa",
          "string": "تمام بازیگرانی که در فیلم های کارگردانی شده توسط ویلیام شاتنر بازی کرده اند را لیست کن.",
          "keywords": "بازیگرانی، فیلم های، کارگردانی شده، ویلیام شاتنر، بازی کرده اند"
        },
        {
          "language": "de",
          "string": "Gib mir alle Schauspieler von Filmen, in denen William Shatner Regie geführt hat.",
          "keywords": "Schauspieler, Film, Regie, William Shatner"
        },
        {
          "language": "es",
          "string": "Dame todos los actores de películas dirigidas por William Shatner.",
          "keywords": "actor, película, director, William Shatner"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli attori che recitano in film diretti da William Shatner.",
          "keywords": "attore, recitare, film, diretto, William Shatner"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les acteurs qui ont joué dans des films réalisés par Williams Shatner.",
          "keywords": "acteur, film, réalisé, William Shatner"
        },
        {
          "language": "nl",
          "string": "Geef alle acteurs van films waar William Shatner de regie van voerde.",
          "keywords": "acteur, film, regisseur, William Shatner"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți actorii care joacă roluri principale în filme regizate de William Shatner.",
          "keywords": "actor, rol principal, film, regiza, William Shatner"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?x \u003chttp://dbpedia.org/ontology/director\u003e \u003chttp://dbpedia.org/resource/William_Shatner\u003e .  ?x \u003chttp://dbpedia.org/ontology/starring\u003e ?uri . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT actors/NNS starring/VBG in/IN movies/NNS directed/VBN by/IN William/NNP Shatner/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(actors,all) \n dobj(Give,actors) \n vmod(actors,starring) \n prep(starring,in) \n pobj(in,movies) \n vmod(movies,directed) \n prep(directed,by) \n nn(Shatner,William) \n pobj(by,Shatner)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(actors,actors) \n ARGP(starring,movies) \n ARGP(directed,William Shatner)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v8  ?v19  ?v18 . \n     ?v5  ?v12  ?v7 . \n     ?v8  ?v17  ?v10 . \n     ?v3  ?v21  ?v20 . \n     ?v7  ?v16  ?v15 . \n     ?v5  ?v14  ?v13 . \n   } \n  \n  v13 starring (rdf:Class) \n  v21 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v12 ARGP (rdf:Property) \n  v15 movies (rdf:Class) \n  v17 ARGP (rdf:Property) \n  v14 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v16 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v10 William Shatner (rdf:Resource) \n  v18 directed (rdf:Class) \n  v19 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v20 actors (rdf:Class) \n  \n Score: 0.8",
          "creator": "rocknrole"
        }
      ]
    }
  ]
}