{
  "dataset": {
    "id": "qald-6-train-multilingual"
  },
  "questions": [
    {
      "id": "346",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "List the seven kings of Rome.",
          "keywords": "kings, Rome"
        },
        {
          "language": "fa",
          "string": "هفت پادشاه رم را لیست کن.",
          "keywords": "پادشاه، رم"
        },
        {
          "language": "de",
          "string": "Gib mir eine Liste aller Könige von Rom.",
          "keywords": "Könige, Rom"
        },
        {
          "language": "es",
          "string": "Lista los siete reyes de Roma.",
          "keywords": "siete reyes Roma"
        },
        {
          "language": "it",
          "string": "Elenca i sette re di Roma.",
          "keywords": "sette re, Roma"
        },
        {
          "language": "fr",
          "string": "Donne-moi les sept rois de Rome.",
          "keywords": "rois, Rome"
        },
        {
          "language": "nl",
          "string": "Geef de seven koningen van Rome.",
          "keywords": "koningen, Rome"
        },
        {
          "language": "ro",
          "string": "Enumeră cei șapte regi ai Romei.",
          "keywords": "șapte regi, Roma"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://dbpedia.org/property/title\u003e \u003chttp://dbpedia.org/resource/King_of_Rome\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "List/VB the/DT seven/CD kings/NNS of/IN Rome/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "det(kings,the) \n num(kings,seven) \n dobj(List,kings) \n prep(kings,of) \n pobj(of,Rome)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARG1(List,kings) \n ARGP(kings,Rome)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "ASK \n WHERE \n   { ?v2  ?v15  ?v14 ; \n          ?v12  ?v11 . \n     ?v1  ?v8   ?v2 ; \n          ?v10  ?v9 . \n     ?v2  ?v13  ?v6 . \n   } \n  \n  v10 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v12 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v6 Rome (rdf:Resource) \n  v8 ARG1 (rdf:Property) \n  v9 List (rdf:Class) \n  v11 kings (rdf:Class) \n  v14 kings (rdf:Class) \n  v15 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v13 ARGP (rdf:Property) \n  \n Score: 0.8181818181818182",
          "creator": "rocknrole"
        }
      ]
    }
  ]
}