{
  "dataset": {
    "id": "qald-6-train-multilingual"
  },
  "questions": [
    {
      "id": "53",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all federal chancellors of Germany.",
          "keywords": "Germany, federal chancellors"
        },
        {
          "language": "fa",
          "string": "تمام صدراعظم های آلمان را لیست کن.",
          "keywords": "صدراعظم های، آلمان"
        },
        {
          "language": "de",
          "string": "Gib mir alle Bundeskanzler.",
          "keywords": "Bundeskanzler"
        },
        {
          "language": "es",
          "string": "Dame todos los cancilleres alemanos.",
          "keywords": "cancilleres, alemanos"
        },
        {
          "language": "it",
          "string": "Dammi tutti i cancellieri tedeschi.",
          "keywords": "cancellieri, tedeschi"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les chancelièrs allemands.",
          "keywords": "chanceliers, allemands"
        },
        {
          "language": "nl",
          "string": "Noem alle Duitse bondskanseliers.",
          "keywords": "Duits, bondskanseliers"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți cancelarii federali ai Germaniei",
          "keywords": "Germania, cancelar federal"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Person\u003e .  { ?uri \u003chttp://dbpedia.org/ontology/office\u003e \u0027Chancellor of Germany\u0027 . }  UNION  { ?uri \u003chttp://dbpedia.org/property/office\u003e \u003chttp://dbpedia.org/resource/Chancellor_of_Germany\u003e . } } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT federal/JJ chancellors/NNS of/IN Germany/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(chancellors,all) \n amod(chancellors,federal) \n dobj(Give,chancellors) \n prep(chancellors,of) \n pobj(of,Germany)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(chancellors,chancellors) \n ARGP(chancellors,Germany) \n REL(chancellors,federal)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v9   ?v7 ; \n          ?v11  ?v10 ; \n          ?v14  ?v13 ; \n          ?v12  ?v5 . \n   } \n  \n  v11 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v9 ARGP (rdf:Property) \n  v7 Germany (rdf:Resource) \n  v10 chancellors (rdf:Class) \n  v13 chancellors (rdf:Class) \n  v5 federal (rdf:Resource) \n  v14 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v12 - (rdf:Property) \n  \n Score: 0.8888888888888888",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "57",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "List all episodes of the first season of the HBO television series The Sopranos.",
          "keywords": "HBO, television series, Sopranos, first season, episode"
        },
        {
          "language": "fa",
          "string": "تمام قسمت های فصل اول سریال تلویزیونی سوپرانوز متعلق به اچ.بی.او را لیست کن.",
          "keywords": "قسمت های، فصل اول، سریال تلویزیونی، سوپرانوز، اچ.بی.او"
        },
        {
          "language": "de",
          "string": "Liste alle Episoden der ersten Staffel der HBO-Fernsehserie Die Sopranos auf.",
          "keywords": "HBO-Fernsehserie, Sopranos, erste Staffel, Episode"
        },
        {
          "language": "es",
          "string": "Dame todos los episodios de la prímera época de la serie de HBO Los Sporanos.",
          "keywords": "serie televisiva de HBO, Los Sopranos, primera época, episodios"
        },
        {
          "language": "it",
          "string": "Elenca tutti gli episodi della prima stagione della serie televisiva di HBO i Sopranos.",
          "keywords": "serie televisiva di HBO, i Sopranos, prima stagione, episodio"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les épisodes de la première saison de la série télévisée de HBO les Sopranos.",
          "keywords": "épisodes de la première saison, HBO, les Sopranos"
        },
        {
          "language": "nl",
          "string": "Noem alle afleveringen van het eerste seizoen van de HBO-serie The Sopranos.",
          "keywords": "HBO-serie, The Sopranos, eerste seizoen, aflevering"
        },
        {
          "language": "ro",
          "string": "Listează toate episodele din primul sezon al serialului HBO de televiziune The Sopranos",
          "keywords": "HBO, serial de televiziune, Sopranos, primul sezon, episod"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://dbpedia.org/ontology/series\u003e \u003chttp://dbpedia.org/resource/The_Sopranos\u003e .  ?uri \u003chttp://dbpedia.org/ontology/seasonNumber\u003e 1 . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "List/VB all/DT episodes/NNS of/IN the/DT first/JJ season/NN of/IN the/DT HBO/NNP television/NN series/NN The/DT Sopranos/NNPS ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "det(episodes,all) \n nsubj(Sopranos,episodes) \n prep(episodes,of) \n det(season,the) \n amod(season,first) \n pobj(of,season) \n prep(season,of) \n det(series,the) \n nn(series,HBO) \n nn(series,television) \n pobj(of,series) \n det(Sopranos,The) \n xcomp(List,Sopranos)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARG0(Sopranos,episodes) \n ARGP(episodes,season) \n ARGP(season,television HBO series) \n REL(season,first)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "ASK \n WHERE \n   { ?v6   ?v20  ?v10 . \n     ?v2   ?v15  ?v6 . \n     ?v6   ?v27  ?v26 . \n     ?v4   ?v12  ?v2 . \n     ?v2   ?v17  ?v16 . \n     ?v6   ?v22  ?v21 ; \n           ?v19  ?v18 . \n     ?v10  ?v24  ?v23 . \n     ?v6   ?v25  ?v8 . \n     ?v2   ?v14  ?v13 . \n   } \n  \n  v25 - (rdf:Property) \n  v18 season (rdf:Class) \n  v24 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v17 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v21 season (rdf:Class) \n  v22 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v19 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v16 episodes (rdf:Class) \n  v23 television HBO series (rdf:Class) \n  v12 ARG0 (rdf:Property) \n  v14 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v26 season (rdf:Class) \n  v8 first (rdf:Resource) \n  v20 ARGP (rdf:Property) \n  v27 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v4 Sopranos (rdf:Resource) \n  v15 ARGP (rdf:Property) \n  v13 episodes (rdf:Class) \n  \n Score: 0.8095238095238095",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "59",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all people with first name Jimmy.",
          "keywords": "person, first name, Jimmy"
        },
        {
          "language": "fa",
          "string": "تمام افرادی که اسم کوچک آنها جیمی است را لیست کن.",
          "keywords": "افرادی، اسم کوچک، جیمی"
        },
        {
          "language": "de",
          "string": "Gib mir alle Personen, die den Vornamen Jimmy haben.",
          "keywords": "Person, Vorname, Jimmy"
        },
        {
          "language": "es",
          "string": "Dame todas las personas con el nombre propio Jimmy.",
          "keywords": "personas, nombre propio, Jimmy"
        },
        {
          "language": "it",
          "string": "Dammi tutte le persone il cui nome è Jimmy.",
          "keywords": "persone, nome, Jimmy"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les personnes dont le prénom est Jimmy.",
          "keywords": "personnes, prénom, Jimmy"
        },
        {
          "language": "nl",
          "string": "Noem alle personen met de voornaam Jimmy.",
          "keywords": "persoon, voornaam, Jimmy"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate persoanele cu prenumele Jimmy",
          "keywords": "persoană, prenume, Jimmy"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e foaf:Person .  ?uri foaf:givenName \u0027Jimmy\u0027@en . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT people/NNS with/IN first/JJ name/NN Jimmy/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(people,all) \n dobj(Give,people) \n prep(people,with) \n amod(Jimmy,first) \n nn(Jimmy,name) \n pobj(with,Jimmy)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(people,people) \n ARGP(people,name Jimmy) \n REL(name Jimmy,first)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v6  ?v12  ?v7 . \n     ?v3  ?v11  ?v10 ; \n          ?v9   ?v6 . \n   } \n  \n  v6 name Jimmy (rdf:Resource) \n  v12 - (rdf:Property) \n  v7 first (rdf:Resource) \n  v9 ARGP (rdf:Property) \n  v10 people (rdf:Class) \n  v11 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  \n Score: 0.8571428571428571",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "63",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all actors starring in Last Action Hero.",
          "keywords": "actor, starring, Last Action Hero"
        },
        {
          "language": "fa",
          "string": "تمام بازیگرانی که در لست اکشن هیرو بازی کردند را لیست کن.",
          "keywords": "بازیگرانی، لست اکشن هیرو، بازی"
        },
        {
          "language": "de",
          "string": "Gib mir alle Schauspieler, die in Last Action Hero mitgespielt haben.",
          "keywords": "Schauspieler, mitspielen, Last Action Hero"
        },
        {
          "language": "es",
          "string": "Dame todos los actores que hayan actuado en Last Action Hero.",
          "keywords": "actores, Last Action Hero"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli attori che hanno recitato in Last Action Hero.",
          "keywords": "attori, Last Action Hero"
        },
        {
          "language": "fr",
          "string": "Noem alle acteurs uit de film Last Action Hero.",
          "keywords": "acteurs, Last Action Hero"
        },
        {
          "language": "nl",
          "string": "Noem alle acteurs uit de film Last Action Hero.",
          "keywords": "acteur, Last Action Hero"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți actorii cu roluri principale în Last Action Hero.",
          "keywords": "actor, rol principal, Last Action Hero"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  \u003chttp://dbpedia.org/resource/Last_Action_Hero\u003e \u003chttp://dbpedia.org/ontology/starring\u003e ?uri . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT actors/NNS starring/VBG in/IN Last/JJ Action/NNP Hero/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(actors,all) \n dobj(Give,actors) \n vmod(actors,starring) \n prep(starring,in) \n amod(Hero,Last) \n nn(Hero,Action) \n pobj(in,Hero)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(actors,actors) \n ARGP(starring,Action Hero) \n REL(Action Hero,Last)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v5  ?v10  ?v7 . \n     ?v3  ?v15  ?v14 . \n     ?v5  ?v12  ?v11 . \n     ?v7  ?v13  ?v8 . \n   } \n  \n  v12 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v7 Action Hero (rdf:Resource) \n  v11 starring (rdf:Class) \n  v15 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v10 ARGP (rdf:Property) \n  v8 Last (rdf:Resource) \n  v14 actors (rdf:Class) \n  v13 - (rdf:Property) \n  \n Score: 0.8",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "67",
      "answertype": "string",
      "aggregation": "true",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me the websites of companies with more than 500000 employees.",
          "keywords": "website, company, employee, more than 500000"
        },
        {
          "language": "fa",
          "string": "وبسایت شرکت های با بیش از 500000 کارمند را لیست کن.",
          "keywords": "وبسایت، شرکت های، بیش از 500000، کارمند"
        },
        {
          "language": "de",
          "string": "Gib mir alle Webseiten von Unternehmen mit mehr als 500000 Angestellten.",
          "keywords": "Webseite, Unternehmen, Angestellte, mehr als 500000"
        },
        {
          "language": "es",
          "string": "Dame todas las páginas de Web de empresas con más de 500000 empleados.",
          "keywords": "página de Web, empreasas, empleados, más de 500000"
        },
        {
          "language": "it",
          "string": "Dammi tutti i siti internet di aziende con più di 500000 dipendenti.",
          "keywords": "sito internet, azienda, dipendenti, più di 500000"
        },
        {
          "language": "fr",
          "string": "Donnes-moi les sites webs de companies avec plus de 500000 employés.",
          "keywords": "sites webs, companies, plus de 500000 employés"
        },
        {
          "language": "nl",
          "string": "Geef me de websites van alle ondernemingen met meer dan 500000 werknemers.",
          "keywords": "website, onderneming, werknemers, meer dan 500000"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate website-urile de la companiile cu mai mult de 500000 de angajați",
          "keywords": "website, companie, angajat, mai mult de 500000"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?string WHERE {  ?c \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Company\u003e . { ?c \u003chttp://dbpedia.org/ontology/numberOfEmployees\u003e ?employees . } UNION { ?c \u003chttp://dbpedia.org/property/numEmployees\u003e ?employees . }  FILTER( xsd:integer(?employees) \u003e 500000 ) .  ?c \u003chttp://dbpedia.org/property/homepage\u003e ?string . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP the/DT websites/NNS of/IN companies/NNS with/IN more/JJR than/IN 500000/CD employees/NNS ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(websites,the) \n dobj(Give,websites) \n prep(websites,of) \n pobj(of,companies) \n prep(companies,with) \n mwe(than,more) \n quantmod(500000,than) \n num(employees,500000) \n pobj(with,employees)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(websites,websites) \n ARGP(websites,companies) \n ARGP(companies,employees)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v6   ?v20  ?v19 . \n     ?v3   ?v15  ?v14 . \n     ?v6   ?v17  ?v16 . \n     ?v11  ?v22  ?v21 . \n     ?v3   ?v13  ?v6 . \n     ?v6   ?v18  ?v11 . \n   } \n  \n  v14 websites (rdf:Class) \n  v21 employees (rdf:Class) \n  v18 ARGP (rdf:Property) \n  v13 ARGP (rdf:Property) \n  v20 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v17 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v19 companies (rdf:Class) \n  v15 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v22 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v16 companies (rdf:Class) \n  \n Score: 0.8461538461538461",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "70",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all films produced by Hal Roach.",
          "keywords": "film, produce, Hal Roach"
        },
        {
          "language": "fa",
          "string": "تمام فیلم های تولید شده توسط هال روچ را لیست کن.",
          "keywords": "فیلم های، تولید، هال روچ"
        },
        {
          "language": "de",
          "string": "Gib mir alle Filme des Produzenten Hal Roach.",
          "keywords": "Film, Produzent, Hal Roach"
        },
        {
          "language": "es",
          "string": "Dame todas las películas del producente Hal Roach.",
          "keywords": "película, producente, Hal Roach"
        },
        {
          "language": "it",
          "string": "Dammi tutti i film prodotti da Hal Roach.",
          "keywords": "film, produrre, Hal Roach"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les films produits par Hal Roach.",
          "keywords": "films, produits, Hal Roach"
        },
        {
          "language": "nl",
          "string": "Noem alle films die zijn geproduceerd door Hal Roach.",
          "keywords": "film, producent, Hal Roach"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate filmele produse de Hal Roach",
          "keywords": "film, produs, Hal Roach"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Film\u003e .  ?uri \u003chttp://dbpedia.org/ontology/producer\u003e \u003chttp://dbpedia.org/resource/Hal_Roach\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT films/NNS produced/VBN by/IN Hal/NNP Roach/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(films,all) \n dobj(Give,films) \n vmod(films,produced) \n prep(produced,by) \n nn(Roach,Hal) \n pobj(by,Roach)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(films,films) \n ARGP(produced,Hal Roach)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v5  ?v9   ?v7 . \n     ?v3  ?v13  ?v12 . \n     ?v5  ?v11  ?v10 . \n   } \n  \n  v7 Hal Roach (rdf:Resource) \n  v11 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v12 films (rdf:Class) \n  v10 produced (rdf:Class) \n  v13 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v9 ARGP (rdf:Property) \n  \n Score: 0.875",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "71",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all video games published by Mean Hamster Software.",
          "keywords": "video game, publish, Mean Hamster Software"
        },
        {
          "language": "fa",
          "string": "تمام بازی های ویدئویی که توسط مین همستر سافتور منتشر شدند را لیست کن.",
          "keywords": "بازی های ویدئویی، مین همستر سافتور، منتشر"
        },
        {
          "language": "de",
          "string": "Gib mir alle Videospiele von Mean Hamster Software.",
          "keywords": "Videospiel, Mean Hamster Software"
        },
        {
          "language": "es",
          "string": "Dame todos los videojuegos de Mean Hamster Software.",
          "keywords": "videojuego, Mean Hamster Software"
        },
        {
          "language": "it",
          "string": "Dammi tutti i videogiochi di Mean Hamster Software.",
          "keywords": "videogioco, prodotto, Mean Hamster Software"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les jeux vidéos publiés par Mean Hamster Software.",
          "keywords": "jeux vidéos, publiés, Mean Hamster Software"
        },
        {
          "language": "nl",
          "string": "Geef me alle videogames van Mean Hamster Software.",
          "keywords": "videogame, Mean Hamster Software"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate jocurile video publicate de Mean Hamster Software",
          "keywords": "joc video, publicat, Mean Hamster Software"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/VideoGame\u003e . ?uri \u003chttp://dbpedia.org/ontology/publisher\u003e \u003chttp://dbpedia.org/resource/Mean_Hamster_Software\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT video/NN games/NNS published/VBN by/IN Mean/NN Hamster/NNP Software/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(games,all) \n nn(games,video) \n dobj(Give,games) \n vmod(games,published) \n prep(published,by) \n nn(Software,Mean) \n nn(Software,Hamster) \n pobj(by,Software)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(video games,video games) \n ARGP(published,Hamster Mean Software)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v6  ?v10  ?v8 ; \n          ?v12  ?v11 . \n     ?v3  ?v14  ?v13 . \n   } \n  \n  v10 ARGP (rdf:Property) \n  v13 video games (rdf:Class) \n  v12 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v8 Hamster Mean Software (rdf:Resource) \n  v14 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v11 published (rdf:Class) \n  \n Score: 0.875",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "80",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all Canadian Grunge record labels.",
          "keywords": "record label, Canadian, Grunge"
        },
        {
          "language": "fa",
          "string": "تمام ناشران موسیقی گرانج کانادایی را لیست کن.",
          "keywords": "ناشران موسیقی، گرانج، کانادایی"
        },
        {
          "language": "de",
          "string": "Gib mir alle kanadischen Grunge-Plattenfirmen.",
          "keywords": "kanadisch, Plattenfirma, Grunge"
        },
        {
          "language": "es",
          "string": "Dame todos las empresas canadienses productoras de música Grunge.",
          "keywords": "empresa productora de música, canadiense, Grunge"
        },
        {
          "language": "it",
          "string": "Dammi tutti i produttori canadesi di musica Grunge.",
          "keywords": "produttore di musica, canadese, Grunge"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les labels discographiques canadiens de grunge.",
          "keywords": "labels discographiques, canadiens, grunge"
        },
        {
          "language": "nl",
          "string": "Noem alle Canadese grunge-platenlabels.",
          "keywords": "Canadees, platenlabel, Grunge"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate casele canadiene Grunge de înregistrări.",
          "keywords": "casă de înregistrări, canadian, Grunge"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/RecordLabel\u003e .  ?uri \u003chttp://dbpedia.org/ontology/genre\u003e \u003chttp://dbpedia.org/resource/Grunge\u003e .  ?uri \u003chttp://dbpedia.org/ontology/country\u003e \u003chttp://dbpedia.org/resource/Canada\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT Canadian/JJ Grunge/NN record/NN labels/NNS ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(labels,all) \n amod(labels,Canadian) \n nn(labels,Grunge) \n nn(labels,record) \n dobj(Give,labels)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(record Grunge labels,record Grunge labels) \n REL(record Grunge labels,Canadian)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v9  ?v8 ; \n          ?v7  ?v5 . \n   } \n  \n  v5 Canadian (rdf:Resource) \n  v7 - (rdf:Property) \n  v9 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v8 record Grunge labels (rdf:Class) \n  \n Score: 0.8",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "84",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all movies with Tom Cruise.",
          "keywords": "movie, Tom Cruise"
        },
        {
          "language": "fa",
          "string": "تمام فیلم های تام کروز را لیست کن.",
          "keywords": "فیلم های، تام کروز"
        },
        {
          "language": "de",
          "string": "Gib mir alle Filme mit Tom Cruise.",
          "keywords": "Film, Tom Cruise"
        },
        {
          "language": "es",
          "string": "Dame todas las películas con Tom Cruise",
          "keywords": "películas, Tom Cruise"
        },
        {
          "language": "it",
          "string": "Dammi tutti i film con Tom Cruise.",
          "keywords": "film, Tom Cruise"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les films avec Tom Cruise.",
          "keywords": "films, Tom Cruise"
        },
        {
          "language": "nl",
          "string": "Noem alle films met Tom Cruise.",
          "keywords": "film, Tom Cruise"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate filmele cu Tom Cruise.",
          "keywords": "film, Tom Cruise"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Film\u003e .  ?uri \u003chttp://dbpedia.org/ontology/starring\u003e \u003chttp://dbpedia.org/resource/Tom_Cruise\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT movies/NNS with/IN Tom/NNP Cruise/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(movies,all) \n dobj(Give,movies) \n prep(movies,with) \n nn(Cruise,Tom) \n pobj(with,Cruise)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(movies,movies) \n ARGP(movies,Tom Cruise)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v10  ?v9 ; \n          ?v8   ?v6 . \n   } \n  \n  v10 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v8 ARGP (rdf:Property) \n  v6 Tom Cruise (rdf:Resource) \n  v9 movies (rdf:Class) \n  \n Score: 1.0",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "86",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all female given names.",
          "keywords": "female, given name"
        },
        {
          "language": "fa",
          "string": "تمام اسم های دخترانه را لیست کن.",
          "keywords": "اسم های، دخترانه"
        },
        {
          "language": "de",
          "string": "Gib mir alle weiblichen Vornamen.",
          "keywords": "weiblich, Vorname"
        },
        {
          "language": "es",
          "string": "Dame todos los nombres propios femeninos.",
          "keywords": "nombre propio, femenino"
        },
        {
          "language": "it",
          "string": "Dammi tutti i nomi propri femminili.",
          "keywords": "nome proprio, femminile"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les prénoms féminins.",
          "keywords": "prénom, féminin"
        },
        {
          "language": "nl",
          "string": "Geef me alle vrouwelijke voornaamen.",
          "keywords": "vrouwelijk, voornaam"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate prenumele feminine.",
          "keywords": "feminine, prenume"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/GivenName\u003e .  ?uri \u003chttp://dbpedia.org/ontology/gender\u003e \u003chttp://dbpedia.org/resource/Female\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT female/JJ given/JJ names/NNS ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(names,all) \n amod(names,female) \n amod(names,given) \n dobj(Give,names)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(names,names) \n REL(names,female) \n REL(names,given)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v13  ?v12 ; \n          ?v10  ?v9 ; \n          ?v11  ?v6 ; \n          ?v8   ?v5 . \n   } \n  \n  v8 - (rdf:Property) \n  v9 names (rdf:Class) \n  v10 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v5 female (rdf:Resource) \n  v13 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v12 names (rdf:Class) \n  v6 given (rdf:Resource) \n  v11 - (rdf:Property) \n  \n Score: 0.7777777777777778",
          "creator": "rocknrole"
        }
      ]
    }
  ]
}