{
  "dataset": {
    "id": "qald-6-train-multilingual"
  },
  "questions": [
    {
      "id": "89",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all soccer clubs in the Premier League.",
          "keywords": "Premier League, soccer club"
        },
        {
          "language": "fa",
          "string": "تمام باشگاه های فوتبال در لیگ برتر را لیست کن.",
          "keywords": "باشگاه های فوتبال، لیگ برتر"
        },
        {
          "language": "de",
          "string": "Gib mir alle Vereine in der Premier League.",
          "keywords": "Premier League, Verein"
        },
        {
          "language": "es",
          "string": "Dame todos los clubs de la Premier League.",
          "keywords": "Premier League, club"
        },
        {
          "language": "it",
          "string": "Dammi tutti i club calcistici nella Premier League.",
          "keywords": "Premier League, club calcistici"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les équipes de la Premier League.",
          "keywords": "équipes, Premier League"
        },
        {
          "language": "nl",
          "string": "Noem alle clubs uit de Premier League.",
          "keywords": "club, Premier League"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate cluburile de fotbal din Premier League",
          "keywords": "Premier League, club de fotbal"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/SoccerClub\u003e .  ?uri \u003chttp://dbpedia.org/ontology/league\u003e \u003chttp://dbpedia.org/resource/Premier_League\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT soccer/NN clubs/NNS in/IN the/DT Premier/NNP League/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(clubs,all) \n nn(clubs,soccer) \n dobj(Give,clubs) \n prep(clubs,in) \n det(League,the) \n nn(League,Premier) \n pobj(in,League)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(soccer clubs,soccer clubs) \n ARGP(soccer clubs,Premier League)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v9   ?v7 ; \n          ?v11  ?v10 . \n   } \n  \n  v9 ARGP (rdf:Property) \n  v7 Premier League (rdf:Resource) \n  v11 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v10 soccer clubs (rdf:Class) \n  \n Score: 1.0",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "211",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all animals that are extinct.",
          "keywords": "animal, extinct"
        },
        {
          "language": "fa",
          "string": "تمام حیواناتی که منقرض شده اند را لیست کن.",
          "keywords": "حیواناتی، منقرض"
        },
        {
          "language": "de",
          "string": "Gib mir alle ausgestorbenen Tierarten.",
          "keywords": "Tierart, ausgestorben"
        },
        {
          "language": "es",
          "string": "Dame todos los animales extintos",
          "keywords": "animales extintos"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli animali estinti.",
          "keywords": "animali estinti"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les animaux éteints.",
          "keywords": "animaux éteints"
        },
        {
          "language": "nl",
          "string": "Toon alle uitgestorven dieren.",
          "keywords": "dieren, uitgestorven"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate animalele dispărute.",
          "keywords": "animal, dispărut"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Animal\u003e .  ?uri \u003chttp://dbpedia.org/ontology/conservationStatus\u003e \u0027EX\u0027^^\u003chttp://www.w3.org/2001/XMLSchema#string\u003e . }"
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT animals/NNS that/WDT are/VBP extinct/JJ ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(animals,all) \n dobj(Give,animals) \n nsubj(extinct,that) \n cop(extinct,are) \n rcmod(animals,extinct)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARG0(animals,extinct) \n SELECT(animals,animals) \n EQUALS(extinct,THIS)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v10                  ?v9 . \n     ?v5  \u003chttp://www.w3.org/2002/07/owl#sameAs\u003e  ?v6 ; \n          ?v12                  ?v11 . \n     ?v3  ?v8                   ?v5 . \n   } \n  \n  v9 animals (rdf:Class) \n  v11 extinct (rdf:Class) \n  v8 ARG0 (rdf:Property) \n  v12 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v10 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  \n Score: 0.75",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "240",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me the grandchildren of Elvis Presley.",
          "keywords": "Elvis Presley, grandchildren"
        },
        {
          "language": "fa",
          "string": "نوه های الویس پرسلی را لیست کن.",
          "keywords": "نوه های، الویس پرسلی"
        },
        {
          "language": "de",
          "string": "Gib mir die Enkel von Elvis Presley.",
          "keywords": "Elvis Presley, Enkel"
        },
        {
          "language": "es",
          "string": "Dame todos los nietos de Elvis Presley.",
          "keywords": "Elvis Presley, nietos"
        },
        {
          "language": "it",
          "string": "Dammi i nipoti di Elvis Presley.",
          "keywords": "Elvis Presley, nipoti"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les petit-enfants de Elvis Presley.",
          "keywords": "petit-enfants, Elvis Presley"
        },
        {
          "language": "nl",
          "string": "Toon alle kleinkinderen van Elvis Presley.",
          "keywords": "Elvis Presley, kleinkinderen"
        },
        {
          "language": "ro",
          "string": "Dă-mi nepoții lui Elvis Presley.",
          "keywords": "Elvis Presley, nepoți"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { \u003chttp://dbpedia.org/resource/Elvis_Presley\u003e \u003chttp://dbpedia.org/ontology/child\u003e ?child . ?child \u003chttp://dbpedia.org/ontology/child\u003e ?uri . }"
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP the/DT grandchildren/NNS of/IN Elvis/NNP Presley/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(grandchildren,the) \n dobj(Give,grandchildren) \n prep(grandchildren,of) \n nn(Presley,Elvis) \n pobj(of,Presley)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(grandchildren,grandchildren) \n ARGP(grandchildren,Elvis Presley)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v10  ?v9 ; \n          ?v8   ?v6 . \n   } \n  \n  v10 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v8 ARGP (rdf:Property) \n  v9 grandchildren (rdf:Class) \n  v6 Elvis Presley (rdf:Resource) \n  \n Score: 1.0",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "241",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all writers that won the Nobel Prize in literature.",
          "keywords": "writer, win, Nobel Prize in literature"
        },
        {
          "language": "fa",
          "string": "تمام نویسندگانی که جایزه نوبل در ادبیات را بردند لیست کن.",
          "keywords": "نویسندگانی، جایزه نوبل در ادبیات، بردند"
        },
        {
          "language": "de",
          "string": "Gib mir alle Schriftsteller, die den Literaturnobelpreis gewonnen haben.",
          "keywords": "Schritfsteller, Literaturnobelpreis"
        },
        {
          "language": "es",
          "string": "Dame todos los escritores que hayan recibido el premio nobel de literatura.",
          "keywords": "escritores, premio nobel de literatura"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli scrittori che hanno vinto il Premio Nobel della letteratura.",
          "keywords": "scrittori, Premio Nobel della Letteratura"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les auteurs qui ont gagné le prix Nobel de litérature.",
          "keywords": "auteurs, prix Nobel de litérature"
        },
        {
          "language": "nl",
          "string": "Toon alle schrijvers die de Nobelprijs in literatuur hebben gewonnen.",
          "keywords": "schrijvers, Nobelprijs in literatuur, gewonnen"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți scriitorii care au câștigat premiul Nobel pentru literatură.",
          "keywords": "scriitor, câștigat, premiul Nobel pentru literatură"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Writer\u003e .  ?uri \u003chttp://dbpedia.org/ontology/award\u003e \u003chttp://dbpedia.org/resource/Nobel_Prize_in_Literature\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT writers/NNS that/WDT won/VBD the/DT Nobel/NNP Prize/NNP in/IN literature/NN ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(writers,all) \n dobj(Give,writers) \n nsubj(won,that) \n rcmod(writers,won) \n det(Prize,the) \n nn(Prize,Nobel) \n dobj(won,Prize) \n prep(won,in) \n pobj(in,literature)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARG0(writers,won) \n SELECT(writers,writers) \n won(THIS,literature) \n won(Nobel Prize,literature)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v6   ?v20  ?v19 . \n     ?v3   ?v15  ?v14 . \n     ?v11  ?v25  ?v24 . \n     ?v5   ?v17  ?v16 . \n     ?v11  ?v22  ?v21 . \n     ?v7   ?v23  ?v11 . \n     ?v6   ?v18  ?v11 . \n     ?v3   ?v13  ?v5 . \n   } \n  \n  v24 literature (rdf:Class) \n  v13 ARG0 (rdf:Property) \n  v17 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v7 Nobel Prize (rdf:Resource) \n  v18 won (rdf:Property) \n  v15 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v20 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v23 won (rdf:Property) \n  v22 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v16 won (rdf:Class) \n  v19 THIS (rdf:Class) \n  v25 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v14 writers (rdf:Class) \n  v21 literature (rdf:Class) \n  \n Score: 0.8333333333333334",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "247",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all actors called Baldwin.",
          "keywords": "actors, called, Baldwin"
        },
        {
          "language": "fa",
          "string": "تمام بازیگران با نام بالدوین را لیست کن.",
          "keywords": "بازیگران، نام، بالدوین"
        },
        {
          "language": "de",
          "string": "Gib mir alle Schauspieler, die Baldwin heißen.",
          "keywords": "Schauspieler, heißen, Baldwin"
        },
        {
          "language": "es",
          "string": "Dame todos los actores llamados Baldwin.",
          "keywords": "actores, llamados Baldwin"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli attori che si chiamano Baldwin.",
          "keywords": "attori, chiamarsi, Baldwin"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les acteurs appelés Baldwin.",
          "keywords": "Acteury, appelés, Baldwin"
        },
        {
          "language": "nl",
          "string": "Toon alle acteurs die Baldwin heten.",
          "keywords": "acteurs, heten, Baldwin"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți actorii numiți Baldwin.",
          "keywords": "actori, numit, Baldwin"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri foaf:surname \u0027Baldwin\u0027@en . { ?uri \u003chttp://dbpedia.org/ontology/occupation\u003e \u003chttp://dbpedia.org/resource/Actor\u003e . } UNION { ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Actor\u003e . } } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT actors/NNS called/VBN Baldwin/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(actors,all) \n dobj(Give,actors) \n vmod(actors,called) \n dobj(called,Baldwin)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARG1(called,Baldwin) \n SELECT(actors,actors)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v5  ?v10  ?v9 . \n     ?v3  ?v12  ?v11 . \n     ?v5  ?v8   ?v6 . \n   } \n  \n  v9 called (rdf:Class) \n  v8 ARG1 (rdf:Property) \n  v10 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v12 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v11 actors (rdf:Class) \n  v6 Baldwin (rdf:Resource) \n  \n Score: 0.875",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "205",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all Dutch parties.",
          "keywords": "Dutch, party"
        },
        {
          "language": "fa",
          "string": "تمام حزب های هلندی را لیست کن.",
          "keywords": "حزب، هلند"
        },
        {
          "language": "de",
          "string": "Gib mir alle Niederländischen Parteien.",
          "keywords": "Niederländisch, Partei"
        },
        {
          "language": "es",
          "string": "Dame todos los partidos políticos holandeses",
          "keywords": "partidos políticos holandeses"
        },
        {
          "language": "it",
          "string": "Dammi tutti i partiti politici olandesi.",
          "keywords": "partiti politici olandesi"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les partis politiques néerlandais.",
          "keywords": "partis poliques, néerlandais"
        },
        {
          "language": "nl",
          "string": "Toon alle Nederlandse partijen.",
          "keywords": "Nederlandse partijen."
        },
        {
          "language": "ro",
          "string": "Dă-mi toate partidele politice olandeze.",
          "keywords": "partide politice olandeze"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/PoliticalParty\u003e .  ?uri \u003chttp://dbpedia.org/ontology/country\u003e \u003chttp://dbpedia.org/resource/Netherlands\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT Dutch/JJ parties/NNS ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(parties,all) \n amod(parties,Dutch) \n dobj(Give,parties)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(parties,parties) \n REL(parties,Dutch)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v9  ?v8 ; \n          ?v7  ?v5 . \n   } \n  \n  v7 - (rdf:Property) \n  v5 Dutch (rdf:Resource) \n  v8 parties (rdf:Class) \n  v9 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  \n Score: 0.8",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "243",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all Swedish oceanographers.",
          "keywords": "Swedish, oceanographer"
        },
        {
          "language": "fa",
          "string": "تمام اقیانوس شناسان سوئدی را لیست کن.",
          "keywords": "اقیانوس شناسان، سوئدی"
        },
        {
          "language": "de",
          "string": "Gib mir alle Schwedischen Ozeanographen.",
          "keywords": "Schwedisch, Ozeanographen"
        },
        {
          "language": "es",
          "string": "Dame todos los oceanógrafos suecos.",
          "keywords": "oceanógrafos suecos"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli oceanografi svedesi.",
          "keywords": "svedesi, oceanografi"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les océanographes suédois.",
          "keywords": "Océanographes, suédois"
        },
        {
          "language": "nl",
          "string": "Toon alle Zweedse oceanograafen.",
          "keywords": "Zweedse, oceanograafen"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți oceanografii suedezi.",
          "keywords": "oceanograf, suedez"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://dbpedia.org/ontology/field\u003e \u003chttp://dbpedia.org/resource/Oceanography\u003e .  ?uri \u003chttp://dbpedia.org/ontology/birthPlace\u003e \u003chttp://dbpedia.org/resource/Sweden\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT Swedish/JJ oceanographers/NNS ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(oceanographers,all) \n amod(oceanographers,Swedish) \n dobj(Give,oceanographers)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(oceanographers,oceanographers) \n REL(oceanographers,Swedish)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v9  ?v8 ; \n          ?v7  ?v5 . \n   } \n  \n  v7 - (rdf:Property) \n  v9 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v5 Swedish (rdf:Resource) \n  v8 oceanographers (rdf:Class) \n  \n Score: 0.8",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "226",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all actors who were born in Berlin.",
          "keywords": "actors, born, Berlin"
        },
        {
          "language": "fa",
          "string": "تمام بازیگرانی که در برلین متولد شدند را لیست کن.",
          "keywords": "بازیگرانی، برلین، متولد"
        },
        {
          "language": "de",
          "string": "Gib mir alle in Berlin geborenenen Schauspieler.",
          "keywords": "Schauspieler, geboren, Berlin"
        },
        {
          "language": "es",
          "string": "Dame todos los actores nacidos en Berlin.",
          "keywords": "actores, nacidos, Berlin"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli attori nati a Berlino.",
          "keywords": "attori, nati, Berlino"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les acteurs nés à Berlin.",
          "keywords": "acteurs, lieu de naissance, Berlin"
        },
        {
          "language": "nl",
          "string": "Toon alle acteurs die in Berlijn zijn geboren.",
          "keywords": "actuers, geboren, Berlijn"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți actorii care s-au născut la Berlin.",
          "keywords": "actori, născut, Berlin"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Actor\u003e .  ?uri \u003chttp://dbpedia.org/ontology/birthPlace\u003e \u003chttp://dbpedia.org/resource/Berlin\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT actors/NNS who/WP were/VBD born/VBN in/IN Berlin/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(actors,all) \n dobj(Give,actors) \n nsubjpass(born,who) \n auxpass(born,were) \n rcmod(actors,born) \n prep(born,in) \n pobj(in,Berlin)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARG0(actors,born) \n SELECT(AGENT,AGENT) \n SELECT(actors,actors) \n born(AGENT,Berlin)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v6 ?v3 \n WHERE \n   { ?v3  ?v13  ?v12 . \n     ?v6  ?v18  ?v17 . \n     ?v5  ?v15  ?v14 . \n     ?v6  ?v16  ?v9 . \n     ?v3  ?v11  ?v5 . \n   } \n  \n  v16 born (rdf:Property) \n  v11 ARG0 (rdf:Property) \n  v14 born (rdf:Class) \n  v15 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v12 actors (rdf:Class) \n  v17 AGENT (rdf:Class) \n  v13 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v9 Berlin (rdf:Resource) \n  v18 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  \n Score: 0.9166666666666666",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "233",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me the capitals of all countries that the Himalayas run through.",
          "keywords": "countries Himalayas run through, capitals"
        },
        {
          "language": "fa",
          "string": "پایتخت تمام کشورهایی که هیمالیا از آنها می گذرد را لیست کن.",
          "keywords": "پایتخت، کشورهایی، هیمالیا، می گذرد"
        },
        {
          "language": "de",
          "string": "Gib mir die Haupstädte aller Länder, über die sich der Himalaya erstreckt.",
          "keywords": "Länder, erstrecken, Himalaya, Haupstadt"
        },
        {
          "language": "es",
          "string": "Dame las capitales de todos los países que atraviesa el Himalaya.",
          "keywords": "capital de países, atraviesa el Himalaya"
        },
        {
          "language": "it",
          "string": "Dammi tutte le capitali degli stati attraversati dall\u0027Himalaya.",
          "keywords": "capitali, stati attraversati dall\u0027Himalaya"
        },
        {
          "language": "fr",
          "string": "Donne-moi les capitales de tous les pays que l\u0027Himalaya traverse.",
          "keywords": "capitales, pays, traversé, Himalaya"
        },
        {
          "language": "nl",
          "string": "Toon de hoofdsteden van alle landen waardoor de Himalaya loopt.",
          "keywords": "Himalaya, lopen door, landen, hoofdsteden"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate țările traversate de Himalaya și capitalele lor.",
          "keywords": "țări, traversate de Himalaya, capitale"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  \u003chttp://dbpedia.org/resource/Himalayas\u003e \u003chttp://dbpedia.org/property/country\u003e ?country .  ?country \u003chttp://dbpedia.org/ontology/capital\u003e ?uri . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP the/DT capitals/NNS of/IN all/DT countries/NNS that/IN the/DT Himalayas/NNPS run/VBP through/IN ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(capitals,the) \n dobj(Give,capitals) \n prep(capitals,of) \n det(countries,all) \n pobj(of,countries) \n mark(run,that) \n det(Himalayas,the) \n nsubj(run,Himalayas) \n dep(countries,run) \n prep(run,through)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARG0(run,Himalayas) \n SELECT(capitals,capitals) \n ARGP(capitals,countries)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v8  ?v14  ?v13 . \n     ?v3  ?v15  ?v6 ; \n          ?v17  ?v16 . \n     ?v8  ?v12  ?v10 . \n     ?v6  ?v19  ?v18 . \n   } \n  \n  v13 run (rdf:Class) \n  v14 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v15 ARGP (rdf:Property) \n  v16 capitals (rdf:Class) \n  v19 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v10 Himalayas (rdf:Resource) \n  v18 countries (rdf:Class) \n  v12 ARG0 (rdf:Property) \n  v17 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  \n Score: 0.8333333333333334",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "229",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all Australian metalcore bands.",
          "keywords": "Australian, metalcore bands"
        },
        {
          "language": "fa",
          "string": "تمام باندهای متال کور استرالیایی را لیست کن.",
          "keywords": "باندهای متال کور، استرالیایی"
        },
        {
          "language": "de",
          "string": "Gib mir alle australischen Metalcore-Bands.",
          "keywords": "australisch, Metalcore-Bands"
        },
        {
          "language": "es",
          "string": "Dame todos los grupos australianos de metalcore.",
          "keywords": "grupos australianos metalcore"
        },
        {
          "language": "it",
          "string": "Dammi tutte i gruppi metalcore australiani.",
          "keywords": "gruppi metalcore, australiani"
        },
        {
          "language": "fr",
          "string": "Donnes les groupes de métalcode australiens.",
          "keywords": "groupe, métalcode, australien"
        },
        {
          "language": "nl",
          "string": "Toon alle Australisch metalcore bands.",
          "keywords": "Australisch, metalcore bands"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate trupele metalcore australiene.",
          "keywords": "australian, trupe metalcore"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Band\u003e .  ?uri \u003chttp://dbpedia.org/ontology/genre\u003e \u003chttp://dbpedia.org/resource/Metalcore\u003e . { ?uri \u003chttp://dbpedia.org/ontology/hometown\u003e \u003chttp://dbpedia.org/resource/Australia\u003e . } UNION { ?uri \u003chttp://dbpedia.org/ontology/hometown\u003e ?h .  ?h \u003chttp://dbpedia.org/ontology/country\u003e \u003chttp://dbpedia.org/resource/Australia\u003e . } } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT Australian/JJ metalcore/NN bands/NNS ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(bands,all) \n amod(bands,Australian) \n nn(bands,metalcore) \n dobj(Give,bands)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(metalcore bands,metalcore bands) \n REL(metalcore bands,Australian)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v9  ?v8 ; \n          ?v7  ?v5 . \n   } \n  \n  v8 metalcore bands (rdf:Class) \n  v9 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v5 Australian (rdf:Resource) \n  v7 - (rdf:Property) \n  \n Score: 0.8",
          "creator": "rocknrole"
        }
      ]
    }
  ]
}