{
  "dataset": {
    "id": "qald-6-train-multilingual"
  },
  "questions": [
    {
      "id": "176",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "List the children of Margaret Thatcher.",
          "keywords": "Margaret Thatcher, child"
        },
        {
          "language": "fa",
          "string": "فرزندان مارگارت تاچر را لیست کن.",
          "keywords": "فرزندان، مارگارت تاچر"
        },
        {
          "language": "de",
          "string": "Liste die Kinder von Margaret Thatcher auf.",
          "keywords": "Margaret Thatcher, Kind"
        },
        {
          "language": "es",
          "string": "Dame una lista de los hijos de Margaret Thatcher.",
          "keywords": "Margaret Thatcher, hijos"
        },
        {
          "language": "it",
          "string": "Elenca i figli di Margaret Thatcher.",
          "keywords": "Margaret Thatcher, figlio"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les enfants de Margaret Thatcher.",
          "keywords": "enfants, Margaret Thatcher"
        },
        {
          "language": "nl",
          "string": "Noem alle kinderen van Margaret Thatcher.",
          "keywords": "kinderen, Margaret Thatcher"
        },
        {
          "language": "ro",
          "string": "Enumeră copiii lui Margaret Thatcher.",
          "keywords": "Margaret Thatcher, copil"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  \u003chttp://dbpedia.org/resource/Margaret_Thatcher\u003e \u003chttp://dbpedia.org/ontology/child\u003e ?uri . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "List/VB the/DT children/NNS of/IN Margaret/NNP Thatcher/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "det(children,the) \n dobj(List,children) \n prep(children,of) \n nn(Thatcher,Margaret) \n pobj(of,Thatcher)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARG1(List,children) \n ARGP(children,Margaret Thatcher)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "ASK \n WHERE \n   { ?v1  ?v9   ?v8 . \n     ?v2  ?v11  ?v10 . \n     ?v1  ?v7   ?v2 . \n     ?v2  ?v12  ?v5 ; \n          ?v14  ?v13 . \n   } \n  \n  v9 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v13 children (rdf:Class) \n  v7 ARG1 (rdf:Property) \n  v10 children (rdf:Class) \n  v8 List (rdf:Class) \n  v11 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v14 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v5 Margaret Thatcher (rdf:Resource) \n  v12 ARGP (rdf:Property) \n  \n Score: 0.8181818181818182",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "180",
      "answertype": "resource",
      "aggregation": "true",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all books by William Goldman with more than 300 pages.",
          "keywords": "book, William Goldman, pages, more than 300"
        },
        {
          "language": "fa",
          "string": "تمام کتاب های اثر ویلیام گولدمن با بیشتر از 300 صفحه را لیست کن.",
          "keywords": "کتاب های، ویلیام گولدمن، بیشتر از 300، صفحه"
        },
        {
          "language": "de",
          "string": "Gib mir alle Bücher von William Goldman mit mehr als 300 Seiten.",
          "keywords": "Buch, William Goldman, Seiten, mehr als 300"
        },
        {
          "language": "es",
          "string": "Dame todos los libros de Wiliam Goldman con más de 300 páginas.",
          "keywords": "libro, William Goldman, más de 300 páginas"
        },
        {
          "language": "it",
          "string": "Dammi tutti i libri di Wiliam Goldman con più di 300 pagine.",
          "keywords": "libro, Wiliam Goldman, pagine, più di 300"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les livres de William Goldman avec plus de 300 pages.",
          "keywords": "livres, William Goldman, plus de 300 pages"
        },
        {
          "language": "nl",
          "string": "Geef alle boeken van William Goldman met meer dan 300 pagina\u0027s.",
          "keywords": "boeken, William Goldman, meer dan 300 pagina\u0027s"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate carțile de William Glodman cu mai mult de 300 de pagini.",
          "keywords": "carte, William Goldman, pagini, mai mult de 300"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Book\u003e .  ?uri \u003chttp://dbpedia.org/ontology/author\u003e \u003chttp://dbpedia.org/resource/William_Goldman\u003e .  ?uri \u003chttp://dbpedia.org/ontology/numberOfPages\u003e ?x .  FILTER (?x \u003e 300) } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT books/NNS by/IN William/NNP Goldman/NNP with/IN more/JJR than/IN 300/CD pages/NNS ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(books,all) \n dobj(Give,books) \n prep(Give,by) \n nn(Goldman,William) \n pobj(by,Goldman) \n prep(Goldman,with) \n mwe(than,more) \n quantmod(300,than) \n num(pages,300) \n pobj(with,pages)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(books,books) \n ARGP(Give,William Goldman) \n ARGP(William Goldman,pages)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v1   ?v14  ?v6 ; \n           ?v16  ?v15 . \n     ?v12  ?v19  ?v18 . \n     ?v3   ?v21  ?v20 . \n     ?v6   ?v17  ?v12 . \n   } \n  \n  v18 pages (rdf:Class) \n  v16 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v14 ARGP (rdf:Property) \n  v21 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v15 Give (rdf:Class) \n  v20 books (rdf:Class) \n  v6 William Goldman (rdf:Resource) \n  v17 ARGP (rdf:Property) \n  v19 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  \n Score: 0.8333333333333334",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "182",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me a list of all American inventions.",
          "keywords": "American invention"
        },
        {
          "language": "fa",
          "string": "تمام اختراعات آمریکایی را لیست کن.",
          "keywords": "اختراعات آمریکایی"
        },
        {
          "language": "de",
          "string": "Gib mir eine Liste aller amerikanischen Erfindungen.",
          "keywords": "amerikanische Erfindung"
        },
        {
          "language": "es",
          "string": "Dame una lista de todos los inventos americanos.",
          "keywords": "inventos americanos"
        },
        {
          "language": "it",
          "string": "Dammi la lista delle invenzioni americane.",
          "keywords": "invenzioni americane"
        },
        {
          "language": "fr",
          "string": "Donnes-moi la liste de toutes les inventions américaines.",
          "keywords": "inventions américaines"
        },
        {
          "language": "nl",
          "string": "Geef een lijst van alle Amerikaanse uitvindingen.",
          "keywords": "Amerikaanse uitvinding"
        },
        {
          "language": "ro",
          "string": "Dă-mi o listă a tuturor invențiilor americane.",
          "keywords": "invenție americană"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/class/yago/AmericanInventions\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP a/DT list/NN of/IN all/DT American/JJ inventions/NNS ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(list,a) \n dobj(Give,list) \n prep(list,of) \n det(inventions,all) \n amod(inventions,American) \n pobj(of,inventions)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(list,list) \n ARGP(list,inventions) \n REL(inventions,American)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v6  ?v17  ?v16 . \n     ?v3  ?v12  ?v11 . \n     ?v6  ?v14  ?v13 . \n     ?v3  ?v10  ?v6 . \n     ?v6  ?v15  ?v8 . \n   } \n  \n  v11 list (rdf:Class) \n  v10 ARGP (rdf:Property) \n  v13 inventions (rdf:Class) \n  v16 inventions (rdf:Class) \n  v14 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v12 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v17 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v8 American (rdf:Resource) \n  v15 - (rdf:Property) \n  \n Score: 0.8181818181818182",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "192",
      "answertype": "resource",
      "aggregation": "true",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Show me all songs from Bruce Springsteen released between 1980 and 1990.",
          "keywords": "song, Bruce Springsteen, release, between 1980 and 1990"
        },
        {
          "language": "fa",
          "string": "تمام آهنگ های اثر بروس اسپرینگستین را که بین 1980 و 1990 منتشر شدند را لیست کن.",
          "keywords": "آهنگ های، بروس اسپرینگستین، بین 1980 و 1990، منتشر"
        },
        {
          "language": "de",
          "string": "Zeige mir alle Lieder von Bruce Springsteen, die zwischen 1980 und 1990 herausgebracht wurden.",
          "keywords": "Lied, Bruce Springsteen, herausbringen, zwischen 1980 und 1990"
        },
        {
          "language": "es",
          "string": "¿Enseñame todas las canciones de Bruce Springsteen que aparecieron entre 1980 y 1990.",
          "keywords": "canción, Bruce Springsteen, aparecida entre 1980 y 1990"
        },
        {
          "language": "it",
          "string": "Dammi tutte le canzoni di Bruce Springsteen rilasciate tra il 1980 e il 1990.",
          "keywords": "canzone, Bruce Springsteen, rilasciare, tra il 1980 e il 1990"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les morceaux de Bruce Springsteen qui ont été publiés entre 1980 et 1990.",
          "keywords": "morceaux, Bruce Springsteen, publiés entre 1980 et 1990"
        },
        {
          "language": "nl",
          "string": "Geef alle songs van Bruce Springsteen die werden uitgebracht tussen 1980 en 1990.",
          "keywords": "song, Bruce Springsteen, uitgebracht tussen 1980 en 1990"
        },
        {
          "language": "ro",
          "string": "Arată-mi toate melodiile de Bruce Springsten apărute între 1980 și 1990",
          "keywords": "melodie, Bruce Springsteen, apărut, între 1980 și 1990"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Song\u003e .  ?uri \u003chttp://dbpedia.org/ontology/artist\u003e \u003chttp://dbpedia.org/resource/Bruce_Springsteen\u003e .  ?uri \u003chttp://dbpedia.org/ontology/releaseDate\u003e ?date .  FILTER (?date \u003e\u003d \u00271980-01-01\u0027^^xsd:date \u0026\u0026 ?date \u003c\u003d \u00271990-12-31\u0027^^xsd:date) } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Show/NN me/PRP all/DT songs/NNS from/IN Bruce/NNP Springsteen/NNP released/VBD between/IN 1980/CD and/CC 1990/CD ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "nsubj(released,Show) \n dep(Show,me) \n det(songs,all) \n dep(Show,songs) \n prep(songs,from) \n nn(Springsteen,Bruce) \n pobj(from,Springsteen) \n prep(released,between) \n pobj(between,1980) \n cc(1980,and) \n conj(1980,1990)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARGP(songs,Bruce Springsteen) \n released(Show,1980) \n conjunct(and,1980) \n conjunct(and,1990)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "ASK \n WHERE \n   { ?v4   ?v16  ?v15 . \n     ?v11  ?v27  ?v12 . \n     ?v12  ?v31  ?v30 . \n     ?v10  ?v21  ?v20 . \n     ?v11  ?v22  ?v10 . \n     ?v2   ?v17  ?v10 ; \n           ?v19  ?v18 . \n     ?v10  ?v26  ?v25 . \n     ?v4   ?v14  ?v7 . \n     ?v11  ?v24  ?v23 ; \n           ?v29  ?v28 . \n   } \n  \n  v19 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v22 conjunct (rdf:Property) \n  v24 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v25 1980 (rdf:Class) \n  v16 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v29 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v21 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v17 released (rdf:Property) \n  v23 and (rdf:Class) \n  v28 and (rdf:Class) \n  v31 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v30 1990 (rdf:Class) \n  v18 Show (rdf:Class) \n  v14 ARGP (rdf:Property) \n  v26 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v20 1980 (rdf:Class) \n  v27 conjunct (rdf:Property) \n  v15 songs (rdf:Class) \n  v7 Bruce Springsteen (rdf:Resource) \n  \n Score: 0.7916666666666666",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "196",
      "answertype": "string",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all B-sides of the Ramones.",
          "keywords": "Ramones, B-sides"
        },
        {
          "language": "fa",
          "string": "تمام بیسایدهای رامونز را لیست کن.",
          "keywords": "بیسایدهای، رامونز"
        },
        {
          "language": "de",
          "string": "Gib mir alle B-Seiten der Ramones.",
          "keywords": "Ramones, B-Seiten"
        },
        {
          "language": "es",
          "string": "Dame todas las caras B de los Ramones.",
          "keywords": "Ramones, cara B"
        },
        {
          "language": "it",
          "string": "Dammi tutti i lati B dei Ramones.",
          "keywords": "Ramones, lato B"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les faces B des Ramones.",
          "keywords": "faces B, Ramones"
        },
        {
          "language": "nl",
          "string": "Geef alle B-kantjes van singles van de Ramones.",
          "keywords": "B-kant, single, de Ramones"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate laturile B ale Ramones",
          "keywords": "Ramones, laturi B"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?string WHERE {  ?x \u003chttp://dbpedia.org/ontology/musicalArtist\u003e \u003chttp://dbpedia.org/resource/Ramones\u003e .  ?x \u003chttp://dbpedia.org/ontology/bSide\u003e ?string . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT B_sides/NNS of/IN the/DT Ramones/NNPS ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(B_sides,all) \n dobj(Give,B_sides) \n prep(B_sides,of) \n det(Ramones,the) \n pobj(of,Ramones)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(B_sides,B_sides) \n ARGP(B_sides,Ramones)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v10  ?v9 ; \n          ?v8   ?v6 . \n   } \n  \n  v6 Ramones (rdf:Resource) \n  v8 ARGP (rdf:Property) \n  v9 B_sides (rdf:Class) \n  v10 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  \n Score: 1.0",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "2",
      "answertype": "date",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me the birthdays of all actors of the television show Charmed.",
          "keywords": "television show, Charmed, actor, birthday"
        },
        {
          "language": "fa",
          "string": "تاریخ تولد تمام بازیگران نمایش تلویزیونی چارمد را لیست کن.",
          "keywords": "تاریخ تولد، بازیگران، نمایش تلویزیونی، چارمد"
        },
        {
          "language": "de",
          "string": "Gib mir die Geburtstage von allen Darstellern der Fernsehserie Charmed.",
          "keywords": "Fernsehserie, Charmed, Darsteller, Geburtstag"
        },
        {
          "language": "es",
          "string": "Dame los cumpleaños de los actores de la serie de televisión Charmed.",
          "keywords": "serie televisiva, Charmed, actores, cumpleaños"
        },
        {
          "language": "it",
          "string": "Dammi le date dei compleanni di tutti gli attori della serie televisiva Charmed.",
          "keywords": "serie televisiva, Charmed, attore, compleanno"
        },
        {
          "language": "fr",
          "string": "Donnes-moi les dates de naissance des acteurs de la série télévisée Charmed.",
          "keywords": "série télévisée, Charmed, acteurs, date de naissance"
        },
        {
          "language": "nl",
          "string": "Noem de verjaardag van alle acteurs uit de televisieserie Charmed.",
          "keywords": "verjaardag, acteur, televisieserie, Charmed"
        },
        {
          "language": "ro",
          "string": "Dă-mi zilele de naștere a tuturor actorilor din serialul de televiziune Charmed",
          "keywords": "serial de televiziune, Charmed, actor, zi de naștere"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?date WHERE {  \u003chttp://dbpedia.org/resource/Charmed\u003e \u003chttp://dbpedia.org/ontology/starring\u003e ?actor .  ?actor \u003chttp://dbpedia.org/ontology/birthDate\u003e ?date . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP the/DT birthdays/NNS of/IN all/DT actors/NNS of/IN the/DT television/NN show/NN Charmed/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(birthdays,the) \n dobj(Give,birthdays) \n prep(birthdays,of) \n det(actors,all) \n pobj(of,actors) \n prep(actors,of) \n det(Charmed,the) \n nn(Charmed,television) \n nn(Charmed,show) \n pobj(of,Charmed)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(birthdays,birthdays) \n ARGP(birthdays,actors) \n ARGP(actors,show television Charmed)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v13  ?v12 . \n     ?v6  ?v18  ?v17 ; \n          ?v15  ?v14 ; \n          ?v16  ?v9 . \n     ?v3  ?v11  ?v6 . \n   } \n  \n  v13 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v15 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v9 show television Charmed (rdf:Resource) \n  v17 actors (rdf:Class) \n  v12 birthdays (rdf:Class) \n  v11 ARGP (rdf:Property) \n  v14 actors (rdf:Class) \n  v18 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v16 ARGP (rdf:Property) \n  \n Score: 0.9090909090909091",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "28",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all communist countries.",
          "keywords": "communist countries"
        },
        {
          "language": "fa",
          "string": "تمام کشورهای کمونیست را لیست کن.",
          "keywords": "کشورهای، کمونیست"
        },
        {
          "language": "de",
          "string": "Gib mir alle kommunistischen Länder.",
          "keywords": "kommunistische Länder"
        },
        {
          "language": "es",
          "string": "Dame todos los países comunistas.",
          "keywords": "países comunistas"
        },
        {
          "language": "it",
          "string": "Dammi tutti i paesi comunisti.",
          "keywords": "paesi comunisti"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les pays communistes.",
          "keywords": "pays communistes"
        },
        {
          "language": "nl",
          "string": "Geef alle communistische landen.",
          "keywords": "communistische landen"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate țările comuniste.",
          "keywords": "țări comuniste"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Country\u003e . ?uri \u003chttp://dbpedia.org/property/ideology\u003e \u003chttp://dbpedia.org/resource/Communism\u003e . }"
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT communist/JJ countries/NNS ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(countries,all) \n amod(countries,communist) \n dobj(Give,countries)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(countries,countries) \n REL(countries,communist)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v9  ?v8 ; \n          ?v7  ?v5 . \n   } \n  \n  v8 countries (rdf:Class) \n  v7 - (rdf:Property) \n  v5 communist (rdf:Resource) \n  v9 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  \n Score: 0.8",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "41",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all soccer clubs in Spain.",
          "keywords": "Spain, soccer club"
        },
        {
          "language": "fa",
          "string": "تمام باشگاه های فوتبال در اسپانیا را لیست کن.",
          "keywords": "باشگاه های فوتبال، اسپانیا"
        },
        {
          "language": "de",
          "string": "Gib mir alle Fußballvereine in Spanien.",
          "keywords": "Fußballverein, Spanien"
        },
        {
          "language": "es",
          "string": "Dame todos los club de fútbol de España.",
          "keywords": "España, club de fútbol"
        },
        {
          "language": "it",
          "string": "Dammi tutti i club calcistici della Spagna",
          "keywords": "Spagna, club calcistico"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les clubs de football d\u0027Espagne.",
          "keywords": "Espagne, clubs de football"
        },
        {
          "language": "nl",
          "string": "Noem alle Spaanse voetbalclubs.",
          "keywords": "Spanje, voetbalclub"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate cluburile de fotbal din Spania",
          "keywords": "Spania, club de fotbal"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/SoccerClub\u003e .  { ?uri \u003chttp://dbpedia.org/ontology/ground\u003e \u003chttp://dbpedia.org/resource/Spain\u003e . }  UNION  { ?uri \u003chttp://dbpedia.org/property/ground\u003e ?ground .  FILTER (regex(?ground,\u0027Spain\u0027)) } } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT soccer/NN clubs/NNS in/IN Spain/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(clubs,all) \n nn(clubs,soccer) \n dobj(Give,clubs) \n prep(clubs,in) \n pobj(in,Spain)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(soccer clubs,soccer clubs) \n ARGP(soccer clubs,Spain)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v9   ?v7 ; \n          ?v11  ?v10 . \n   } \n  \n  v10 soccer clubs (rdf:Class) \n  v9 ARGP (rdf:Property) \n  v7 Spain (rdf:Resource) \n  v11 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  \n Score: 1.0",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "49",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all companies in the advertising industry.",
          "keywords": "company, advertising industry"
        },
        {
          "language": "fa",
          "string": "تمام شرکت هایی که در صنعت تبلیغات فعال هستند را لیست کن.",
          "keywords": "شرکت هایی، صنعت تبلیغات"
        },
        {
          "language": "de",
          "string": "Gib mir alle Unternehmen, die in der Werbebranche tätig sind.",
          "keywords": "Unternehmen, Werbebranche"
        },
        {
          "language": "es",
          "string": "Dame todas las empresas publicitarias.",
          "keywords": "empresas publicitarias"
        },
        {
          "language": "it",
          "string": "Dammi tutte le aziende pubblicitarie.",
          "keywords": "aziende pubblicitarie"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les agences de publicité.",
          "keywords": "agences de publicité"
        },
        {
          "language": "nl",
          "string": "Noem alle bedrijven die in de reclamebranche actief zijn.",
          "keywords": "bedrijf, reclamebranche"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate companiile din industria publicitară.",
          "keywords": "companii, industria publicitară"
        }
      ],
      "query": {
        "sparql": "SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Company\u003e . { ?uri \u003chttp://dbpedia.org/ontology/industry\u003e \u003chttp://dbpedia.org/resource/Advertising\u003e } UNION { ?uri \u003chttp://dbpedia.org/ontology/industry\u003e ?industry .  FILTER regex(?industry,\u0027advertising\u0027,\u0027i\u0027) . } } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT companies/NNS in/IN the/DT advertising/NN industry/NN ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(companies,all) \n dobj(Give,companies) \n prep(companies,in) \n det(industry,the) \n nn(industry,advertising) \n pobj(in,industry)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(companies,companies) \n ARGP(companies,advertising industry)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v10  ?v9 . \n     ?v6  ?v12  ?v11 . \n     ?v3  ?v8   ?v6 . \n   } \n  \n  v10 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v11 advertising industry (rdf:Class) \n  v9 companies (rdf:Class) \n  v12 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v8 ARGP (rdf:Property) \n  \n Score: 0.8571428571428571",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "51",
      "answertype": "resource",
      "aggregation": "true",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all libraries established earlier than 1400.",
          "keywords": "libraries, established, earlier than 1400"
        },
        {
          "language": "fa",
          "string": "تمام کتاب خانه هایی که قبل از 1400 تأسیس شدند را لیست کن.",
          "keywords": "کتاب خانه هایی، قبل از 1400، تأسیس"
        },
        {
          "language": "de",
          "string": "Gib mir alle Bibliotheken, die vor 1400 gegründet worden.",
          "keywords": "Bibliotheken, gegründet, vor 1400"
        },
        {
          "language": "es",
          "string": "Dame todas las bibliotecas que fueron establecidas antes de 1400.",
          "keywords": "bibliotecas, establecidas, antes de 1400"
        },
        {
          "language": "it",
          "string": "Dammi tutte le biblioteche fondate prima del 1400.",
          "keywords": "biblioteche, fondate, prima del 1400"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les bibliothèques établies avant 1400.",
          "keywords": "bibliothèques, établies, avant 1400"
        },
        {
          "language": "nl",
          "string": "Geef me alle bibliotheken die voor 1400 werden opgericht.",
          "keywords": "bibliotheken, opgericht, voor 1400"
        },
        {
          "language": "ro",
          "string": "Dă-mi tote bibliotecile înființate înainte de 1400",
          "keywords": "biblioteci, înființat, înainte de 1400"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Library\u003e .  ?uri \u003chttp://dbpedia.org/property/established\u003e ?year .  FILTER (?year \u003c 1400) } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT libraries/NNS established/VBN earlier/JJR than/IN 1400/CD ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(libraries,all) \n dobj(Give,libraries) \n vmod(libraries,established) \n advmod(established,earlier) \n prep(established,than) \n pobj(than,1400)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(libraries,libraries) \n ARGP(established,1400)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v5  ?v10  ?v8 . \n     ?v8  ?v14  ?v13 . \n     ?v3  ?v16  ?v15 . \n     ?v5  ?v12  ?v11 . \n   } \n  \n  v14 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v16 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v11 established (rdf:Class) \n  v12 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v15 libraries (rdf:Class) \n  v13 1400 (rdf:Class) \n  v10 ARGP (rdf:Property) \n  \n Score: 0.8",
          "creator": "rocknrole"
        }
      ]
    }
  ]
}