{
  "dataset": {
    "id": "qald-6-train-multilingual"
  },
  "questions": [
    {
      "id": "252",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give all swimmers that were born in Moscow.",
          "keywords": "swimmer, born, Moscow"
        },
        {
          "language": "fa",
          "string": "تمام شناگرهایی که در مسکو متولد شدند را لیست کن.",
          "keywords": "شناگرهایی، مسکو، متولد"
        },
        {
          "language": "de",
          "string": "Zeig mir alle Schwimmer, die in Moskau geboren wurden.",
          "keywords": "Schwimmer, geboren in, Moskau"
        },
        {
          "language": "es",
          "string": "Dame todos los nadadores nacidos en Moscú",
          "keywords": "nadadores, nacidos, Moscú"
        },
        {
          "language": "it",
          "string": "Dammi tutti i nuotatori che sono nati a Mosca.",
          "keywords": "nuotatori, nati, Mosca"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les nageurs nés à Moscou.",
          "keywords": "nageurs, nés, Moscou"
        },
        {
          "language": "nl",
          "string": "Toen alle zwemmers die werden geboren in Moskou.",
          "keywords": "zwemmers, geboren, Moskou"
        },
        {
          "language": "ro",
          "string": "Numește toți înotătorii născuți în Moscova.",
          "keywords": "înotători, născuți, Moscova"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Swimmer\u003e .  ?uri \u003chttp://dbpedia.org/ontology/birthPlace\u003e \u003chttp://dbpedia.org/resource/Moscow\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB all/DT swimmers/NNS that/WDT were/VBD born/VBN in/IN Moscow/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,all) \n dobj(Give,swimmers) \n nsubjpass(born,that) \n auxpass(born,were) \n rcmod(swimmers,born) \n prep(born,in) \n pobj(in,Moscow)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARG2(Give,all) \n ARG1(Give,swimmers) \n ARG1(born,THIS) \n ARG0(swimmers,born) \n ARGP(born,Moscow)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "ASK \n WHERE \n   { ?v3  ?v27  ?v26 . \n     ?v1  ?v10  ?v2 . \n     ?v4  ?v30  ?v8 . \n     ?v1  ?v17  ?v16 ; \n          ?v15  ?v3 . \n     ?v4  ?v22  ?v21 . \n     ?v3  ?v25  ?v4 . \n     ?v4  ?v32  ?v31 . \n     ?v2  ?v14  ?v13 . \n     ?v3  ?v19  ?v18 . \n     ?v5  ?v24  ?v23 . \n     ?v4  ?v29  ?v28 . \n     ?v1  ?v12  ?v11 . \n     ?v4  ?v20  ?v5 . \n   } \n  \n  v15 ARG1 (rdf:Property) \n  v22 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v12 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v26 swimmers (rdf:Class) \n  v23 THIS (rdf:Class) \n  v17 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v21 born (rdf:Class) \n  v28 born (rdf:Class) \n  v25 ARG0 (rdf:Property) \n  v8 Moscow (rdf:Resource) \n  v10 ARG2 (rdf:Property) \n  v27 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v32 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v14 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v30 ARGP (rdf:Property) \n  v18 swimmers (rdf:Class) \n  v20 ARG1 (rdf:Property) \n  v29 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v13 all (rdf:Class) \n  v16 Give (rdf:Class) \n  v11 Give (rdf:Class) \n  v19 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v24 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v31 born (rdf:Class) \n  \n Score: 0.8275862068965517",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "258",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all the TV shows with Neil Patrick Harris.",
          "keywords": "TV shows, Neil Patrick Harris"
        },
        {
          "language": "fa",
          "string": "تمام نمایش های تلویزیونی با نیل پاتریک هریس را لیست کن.",
          "keywords": "نمایش تلویزیونی، نیل پاتریک هریس"
        },
        {
          "language": "de",
          "string": "Gib mir alle Fernsehserien mit Neil Patrick Harris.",
          "keywords": "Fernsehserien, Neil Patrick Harris"
        },
        {
          "language": "es",
          "string": "Dame todos los programas de televisión con Neil Patrick Harris.",
          "keywords": "programas de televisión, Neil Patrick Harris"
        },
        {
          "language": "it",
          "string": "Dammi tutti i programmi televisivi con Neil Patrick Harris.",
          "keywords": "programmi televisivi, Neil Patrick Harris"
        },
        {
          "language": "fr",
          "string": "Donne-moi toutes les émissions de télé avec Neil Patrick Harris.",
          "keywords": "émissions de télé, Neil Patrick Harris"
        },
        {
          "language": "nl",
          "string": "Toen alle TV programma\u0027s met Neil Patrick Harris.",
          "keywords": "TV programma\u0027s, Neil Patrick Harris"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate emisiunile TV cu Neil Patrick Harris",
          "keywords": "emisiuni TV, Neil Patrick Harris"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/TelevisionShow\u003e .  ?uri \u003chttp://dbpedia.org/ontology/starring\u003e \u003chttp://dbpedia.org/resource/Neil_Patrick_Harris\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/PDT the/DT TV/NN shows/VBZ with/IN Neil/NNP Patrick/NNP Harris/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "csubj(shows,Give) \n iobj(Give,me) \n predet(TV,all) \n det(TV,the) \n dobj(Give,TV) \n prep(shows,with) \n nn(Harris,Neil) \n nn(Harris,Patrick) \n pobj(with,Harris)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(TV,TV) \n ARGP(shows,Patrick Neil Harris)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v4 \n WHERE \n   { ?v1  ?v10  ?v8 ; \n          ?v12  ?v11 . \n     ?v4  ?v14  ?v13 . \n   } \n  \n  v12 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v14 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v10 ARGP (rdf:Property) \n  v8 Patrick Neil Harris (rdf:Resource) \n  v11 shows (rdf:Class) \n  v13 TV (rdf:Class) \n  \n Score: 0.875",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "265",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "List all the musicals with music by Leonard Bernstein.",
          "keywords": "musicals, music by, Leonard Bernstein"
        },
        {
          "language": "fa",
          "string": "تمام فیلم های موزیکال با موسیقی لئونارد برنستاین را لیست کن.",
          "keywords": "فیلم های موزیکال، موسیقی، لئونارد برنستاین"
        },
        {
          "language": "de",
          "string": "Liste alle Musicals mit Musik von Leonard Bernstein auf.",
          "keywords": "Musicals, Musik von, Leonard Bernstein"
        },
        {
          "language": "es",
          "string": "Dame todos los musicales con música de Leonard Bernstein.",
          "keywords": "musicales, música, Leonard Bernstein"
        },
        {
          "language": "it",
          "string": "Elenca tutti i musical con musiche di Leonard Bernstein.",
          "keywords": "musicals, musiche, Leonard Bernstein"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les musicals avec de la musique de Leonard Bernstein.",
          "keywords": "musicals, musique, Leonard Bernstein"
        },
        {
          "language": "nl",
          "string": "Toen een lijst van alle musicals met muziek van Leonard Bernstein.",
          "keywords": "musicals, muziek van, Leonard Bernstein"
        },
        {
          "language": "ro",
          "string": "Listează toate muzicalurile cu muzică de Leonard Bernstein.",
          "keywords": "muzicaluri, muzică de Leonard Bernstein"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Musical\u003e .  ?uri \u003chttp://dbpedia.org/ontology/musicBy\u003e \u003chttp://dbpedia.org/resource/Leonard_Bernstein\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "List/VB all/PDT the/DT musicals/NNS with/IN music/NN by/IN Leonard/NNP Bernstein/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "predet(musicals,all) \n det(musicals,the) \n dobj(List,musicals) \n prep(musicals,with) \n pobj(with,music) \n prep(List,by) \n nn(Bernstein,Leonard) \n pobj(by,Bernstein)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARGP(musicals,music) \n List(musicals,Leonard Bernstein)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "ASK \n WHERE \n   { ?v2  ?v12  ?v11 ; \n          ?v17  ?v16 ; \n          ?v10  ?v6 . \n     ?v6  ?v14  ?v13 . \n     ?v2  ?v15  ?v8 . \n   } \n  \n  v12 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v17 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v8 Leonard Bernstein (rdf:Resource) \n  v10 ARGP (rdf:Property) \n  v11 musicals (rdf:Class) \n  v14 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v16 musicals (rdf:Class) \n  v13 music (rdf:Class) \n  v15 List (rdf:Property) \n  \n Score: 0.8181818181818182",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "266",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Show me all the breweries in Australia.",
          "keywords": "breweries, Australia"
        },
        {
          "language": "fa",
          "string": "تمام آبجوسازی های استرالیا را لیست کن.",
          "keywords": "آبجوسازی های، استرالیا"
        },
        {
          "language": "de",
          "string": "Zeig mir alle Brauereien in Australien.",
          "keywords": "Brauereien, Australien"
        },
        {
          "language": "es",
          "string": "Muéstrame todas las cervecerías en Australia.",
          "keywords": "cervecerías, Australia"
        },
        {
          "language": "it",
          "string": "Mostrami tutti i birrifici in Australia.",
          "keywords": "birrifici, Australia"
        },
        {
          "language": "fr",
          "string": "Montre-moi toutes les brasseries d\u0027Australie.",
          "keywords": "brasseries, Australie"
        },
        {
          "language": "nl",
          "string": "Toen alle brouwerijen in Australië.",
          "keywords": "brouwerijen, Australië"
        },
        {
          "language": "ro",
          "string": "Arată-mi toate berăriile din Australia.",
          "keywords": "berării, Australia"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri ?x WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Brewery\u003e . { ?uri \u003chttp://dbpedia.org/ontology/location\u003e \u003chttp://dbpedia.org/resource/Australia\u003e . } UNION { ?uri \u003chttp://dbpedia.org/ontology/location\u003e ?x .  ?x \u003chttp://dbpedia.org/ontology/country\u003e \u003chttp://dbpedia.org/resource/Australia\u003e . } } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Show/NN me/PRP all/PDT the/DT breweries/NNS in/IN Australia/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "dep(Show,me) \n predet(breweries,all) \n det(breweries,the) \n dep(me,breweries) \n prep(Show,in) \n pobj(in,Australia)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARGP(Show,Australia)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "ASK \n WHERE \n   { ?v1  ?v9   ?v7 ; \n          ?v11  ?v10 . \n   } \n  \n  v11 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v10 Show (rdf:Class) \n  v9 ARGP (rdf:Property) \n  v7 Australia (rdf:Resource) \n  \n Score: 0.8",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "277",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Show me all English Gothic buildings in Kent.",
          "keywords": "English Gothic buildings, Kent"
        },
        {
          "language": "fa",
          "string": "تمام ساختمان های به سبک گوتیک انگلیسی در کنت را لیست کن.",
          "keywords": "ساختمان های، گوتیک انگلیسی، کنت"
        },
        {
          "language": "de",
          "string": "Zeige mir alle Gebäude in Kent, die im Stil der englischen Gothik erbaut wurden.",
          "keywords": "Gebäude, Kent, englische Gotik"
        },
        {
          "language": "es",
          "string": "Muéstrame todos los edificios góticos en Kent.",
          "keywords": "edificios góticos, Kent"
        },
        {
          "language": "it",
          "string": "Mostrami tutti gli edifici in stile gotico inglese nel Kent.",
          "keywords": "edifici, gotico inglese, Kent"
        },
        {
          "language": "fr",
          "string": "Montre-moi tous les bâtiments dans le style gothique anglais à Kent.",
          "keywords": "bâtiments, gothique anglais, Kent"
        },
        {
          "language": "nl",
          "string": "Toen alle gebouwen in Kent, gebouwd in de stijl van het Engels gotiek.",
          "keywords": "gebouwen, Kent, stijl, Engels gotiek"
        },
        {
          "language": "ro",
          "string": "Arată-mi toate clădirile engleze gotice din Kent.",
          "keywords": "clădiri engleze gotice, Kent"
        }
      ],
      "query": {
        "sparql": "SELECT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Building\u003e .  ?uri \u003chttp://dbpedia.org/ontology/architecturalStyle\u003e \u003chttp://dbpedia.org/resource/English_Gothic_architecture\u003e .  ?uri \u003chttp://dbpedia.org/ontology/location\u003e \u003chttp://dbpedia.org/resource/Kent\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Show/NN me/PRP all/DT English/JJ Gothic/JJ buildings/NNS in/IN Kent/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "dep(Show,me) \n det(me,all) \n amod(buildings,English) \n amod(buildings,Gothic) \n dep(Show,buildings) \n prep(buildings,in) \n pobj(in,Kent)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARGP(buildings,Kent) \n REL(buildings,English) \n REL(buildings,Gothic)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "ASK \n WHERE \n   { ?v4  ?v18  ?v17 ; \n          ?v16  ?v6 ; \n          ?v10  ?v8 ; \n          ?v15  ?v14 ; \n          ?v12  ?v11 ; \n          ?v13  ?v5 . \n   } \n  \n  v12 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v14 buildings (rdf:Class) \n  v15 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v5 English (rdf:Resource) \n  v10 ARGP (rdf:Property) \n  v17 buildings (rdf:Class) \n  v18 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v6 Gothic (rdf:Resource) \n  v11 buildings (rdf:Class) \n  v13 - (rdf:Property) \n  v8 Kent (rdf:Resource) \n  v16 - (rdf:Property) \n  \n Score: 0.7692307692307693",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "293",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me English actors starring in Lovesick.",
          "keywords": "English actors, starring, Lovesick"
        },
        {
          "language": "fa",
          "string": "بازیگران انگلیسی که در Lovesick بازی کردند را لیست کن.",
          "keywords": "بازیگران انگلیسی، Lovesick، بازی"
        },
        {
          "language": "de",
          "string": "Gib mir britische Schauspieler, die in Lovesick mitspielen.",
          "keywords": "Schauspieler, britisch, mitspielen, Lovesick"
        },
        {
          "language": "es",
          "string": "Dame actores Ingleses protagonizando Lovesick.",
          "keywords": "actores Ingleses, protagonistas, Lovesick "
        },
        {
          "language": "it",
          "string": "Dammi gli attori inglesi che hanno recitato in Lovesick.",
          "keywords": "attori inglesi, protagonisti, Lovesick"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les acteurs anglais de Lovesick.",
          "keywords": "acteurs, anglais, Lovesick"
        },
        {
          "language": "nl",
          "string": "Toen Brits acteurs met een rol in Lovesick.",
          "keywords": "Brits acteurs, rol in, Lovesick"
        },
        {
          "language": "ro",
          "string": "Dă-mi actori englezi protagoniști în Lovesick.",
          "keywords": "actori englezi, protagoniști, Lovesick"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  \u003chttp://dbpedia.org/resource/Lovesick\u003e \u003chttp://dbpedia.org/ontology/starring\u003e ?uri .  { ?uri \u003chttp://dbpedia.org/ontology/birthPlace\u003e \u003chttp://dbpedia.org/resource/England\u003e . }  UNION  { ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/class/yago/EnglishFilmActors\u003e . } } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP English/JJ actors/NNS starring/VBG in/IN Lovesick/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n amod(actors,English) \n dobj(Give,actors) \n vmod(actors,starring) \n prep(starring,in) \n pobj(in,Lovesick)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(actors,actors) \n ARGP(starring,Lovesick) \n REL(actors,English)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v5  ?v9   ?v7 ; \n          ?v11  ?v10 . \n     ?v3  ?v12  ?v4 ; \n          ?v14  ?v13 . \n   } \n  \n  v7 Lovesick (rdf:Resource) \n  v14 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v10 starring (rdf:Class) \n  v4 English (rdf:Resource) \n  v12 - (rdf:Property) \n  v13 actors (rdf:Class) \n  v9 ARGP (rdf:Property) \n  v11 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  \n Score: 0.8",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "301",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all ESA astronauts.",
          "keywords": "ESA astronauts"
        },
        {
          "language": "fa",
          "string": "تمام فضانوردان ایی.اس.ای را لیست کن.",
          "keywords": "فضانوردان ایی.اس.ای"
        },
        {
          "language": "de",
          "string": "Gib mir alle ESA-Astronauten.",
          "keywords": "ESA-Astronauten"
        },
        {
          "language": "es",
          "string": "Dame todos los astronautas de la ESA.",
          "keywords": "Astronautas ESA"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli astronauti dell\u0027ESA.",
          "keywords": "Astronauti ESA"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les astronautes de l\u0027ESA.",
          "keywords": "austronautes, ESA"
        },
        {
          "language": "nl",
          "string": "Geef alle ESA-astronauten.",
          "keywords": "ESA-astronauten"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți astronauții ESA.",
          "keywords": "astronauți ESA"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Astronaut\u003e .  ?uri \u003chttp://dbpedia.org/ontology/type\u003e \u003chttp://dbpedia.org/resource/European_Space_Agency\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT ESA/NNP astronauts/NNS ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(astronauts,all) \n nn(astronauts,ESA) \n dobj(Give,astronauts)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(ESA astronauts,ESA astronauts)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v6  ?v5 .} \n  \n  v6 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v5 ESA astronauts (rdf:Class) \n  \n Score: 1.0",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "302",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all Swedish holidays.",
          "keywords": "Swedish holidays"
        },
        {
          "language": "fa",
          "string": "تمام تعطیلات سوئدی را لیست کن.",
          "keywords": "تعطیلات سوئدی"
        },
        {
          "language": "de",
          "string": "Gib mir alle schwedischen Feiertage.",
          "keywords": "schwedische Feiertage"
        },
        {
          "language": "es",
          "string": "Dame todos los días festivos en Suecia.",
          "keywords": "días festivos, Suecia"
        },
        {
          "language": "it",
          "string": "Dammi tutti i giorni festivi svedesi.",
          "keywords": "giorni festivi svedesi"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les jours fériés en Suède.",
          "keywords": "jours fériés, Suède"
        },
        {
          "language": "nl",
          "string": "Geef alle Zweedse feestdagen.",
          "keywords": "Zweedse feestdagen"
        },
        {
          "language": "ro",
          "string": "Dă toate zilele de sărbătoare din Suedia.",
          "keywords": "zile de sărbătoare, Suedia"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Holiday\u003e .  ?uri \u003chttp://dbpedia.org/ontology/country\u003e \u003chttp://dbpedia.org/resource/Sweden\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT Swedish/JJ holidays/NNS ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(holidays,all) \n amod(holidays,Swedish) \n dobj(Give,holidays)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "SELECT(holidays,holidays) \n REL(holidays,Swedish)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v3  ?v9  ?v8 ; \n          ?v7  ?v5 . \n   } \n  \n  v7 - (rdf:Property) \n  v5 Swedish (rdf:Resource) \n  v8 holidays (rdf:Class) \n  v9 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  \n Score: 0.8",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "326",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all spacecrafts that flew to Mars.",
          "keywords": "spacecrafts, flew to, Mars"
        },
        {
          "language": "fa",
          "string": "تمام فضاپیماهایی که به مریخ پرواز کردند را لیست کن.",
          "keywords": "فضاپیماهایی، مریخ، پرواز"
        },
        {
          "language": "de",
          "string": "Zeig mir alle Raumschiffe, die zum Mars geflogen sind.",
          "keywords": "Raumschiffe, geflogen, Mars"
        },
        {
          "language": "es",
          "string": "Dame todas las naves espaciales que han volado a Marte",
          "keywords": "naves espaciales, volado, Marte"
        },
        {
          "language": "it",
          "string": "Dammi tutte le astronavi che hanno volato su Marte.",
          "keywords": "astronavi, volare, Marte"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les vaisseaux spatiaux qui ont volé pour Mars.",
          "keywords": "vaisseaux spatiaux, volé, Mars"
        },
        {
          "language": "nl",
          "string": "Geef alle ruimtetuigen die naar Mars werden gestuurd.",
          "keywords": "ruimtetuigen, gestuurd, Mars"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate navele spațiale care au zburat spre Marte.",
          "keywords": "nave spațiale, zburat, Marte"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Spacecraft\u003e .  ?uri \u003chttp://dbpedia.org/property/planet\u003e \u003chttp://dbpedia.org/resource/Mars\u003e . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Give/VB me/PRP all/DT spacecrafts/NNS that/WDT flew/VBD to/TO Mars/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "iobj(Give,me) \n det(spacecrafts,all) \n dobj(Give,spacecrafts) \n nsubj(flew,that) \n rcmod(spacecrafts,flew) \n prep(flew,to) \n pobj(to,Mars)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARG0(spacecrafts,flew) \n SELECT(spacecrafts,spacecrafts) \n flew(THIS,Mars)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v3 \n WHERE \n   { ?v6  ?v17  ?v16 . \n     ?v3  ?v12  ?v11 ; \n          ?v10  ?v5 . \n     ?v5  ?v14  ?v13 . \n     ?v6  ?v15  ?v8 . \n   } \n  \n  v11 spacecrafts (rdf:Class) \n  v16 THIS (rdf:Class) \n  v14 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v15 flew (rdf:Property) \n  v10 ARG0 (rdf:Property) \n  v12 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v13 flew (rdf:Class) \n  v8 Mars (rdf:Resource) \n  v17 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  \n Score: 0.8333333333333334",
          "creator": "rocknrole"
        }
      ]
    },
    {
      "id": "328",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Show me everyone who was born on Halloween.",
          "keywords": "person, born on, Halloween"
        },
        {
          "language": "fa",
          "string": "تمام افرادی که در هالووین متولد شدند را لیست کن.",
          "keywords": "افرادی، هالووین، متولد"
        },
        {
          "language": "de",
          "string": "Nenne mir alle Personen, die an Halloween geboren sind. ",
          "keywords": "Personen, geboren, Halloween"
        },
        {
          "language": "es",
          "string": "Muestrame todas las personas nacidas en Halloween",
          "keywords": "personas nacidas Halloween"
        },
        {
          "language": "it",
          "string": "Mostrami tutti coloro che sono nati ad Halloween.",
          "keywords": "nati, Halloween"
        },
        {
          "language": "fr",
          "string": "Donne-moi toutes les personnes nées à Haloween.",
          "keywords": "personnes, nées, Haloween"
        },
        {
          "language": "nl",
          "string": "Geef een lijst met iedereen die op Halloween is geboren.",
          "keywords": "persoon, geboren, Halloween"
        },
        {
          "language": "ro",
          "string": "Arată-mi toate persoanele care s-au născut de Halloween.",
          "keywords": "persoanele, născut de, Halloween"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri \u003chttp://www.w3.org/1999/02/22-rdf-syntax-ns#type\u003e \u003chttp://dbpedia.org/ontology/Person\u003e . { ?uri \u003chttp://dbpedia.org/ontology/birthDate\u003e ?date . } UNION { ?uri \u003chttp://dbpedia.org/property/birthDate\u003e ?date . }  \u003chttp://dbpedia.org/resource/Halloween\u003e \u003chttp://dbpedia.org/property/date\u003e ?date . } "
      },
      "annotations": [
        {
          "type": "POS",
          "value": "Show/NN me/PRP everyone/NN who/WP was/VBD born/VBN on/IN Halloween/NNP ./. ",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "DEP",
          "value": "nsubj(everyone,me) \n xcomp(Show,everyone) \n nsubjpass(born,who) \n auxpass(born,was) \n rcmod(everyone,born) \n prep(born,on) \n pobj(on,Halloween)",
          "creator": "Stanford Core NLP"
        },
        {
          "type": "SRL",
          "value": "ARG0(everyone,me) \n ARG0(everyone,born) \n SELECT(AGENT,AGENT) \n born(AGENT,Halloween)",
          "creator": "rocknrole"
        },
        {
          "type": "Template",
          "value": "SELECT  ?v5 \n WHERE \n   { ?v2  ?v12  ?v11 ; \n          ?v15  ?v4 . \n     ?v5  ?v20  ?v8 . \n     ?v2  ?v17  ?v16 . \n     ?v5  ?v22  ?v21 . \n     ?v2  ?v10  ?v3 . \n     ?v3  ?v14  ?v13 . \n     ?v4  ?v19  ?v18 . \n   } \n  \n  v19 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v12 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v20 born (rdf:Property) \n  v18 born (rdf:Class) \n  v13 me (rdf:Class) \n  v8 Halloween (rdf:Resource) \n  v16 everyone (rdf:Class) \n  v21 AGENT (rdf:Class) \n  v14 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v15 ARG0 (rdf:Property) \n  v10 ARG0 (rdf:Property) \n  v11 everyone (rdf:Class) \n  v17 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  v22 - (\u003chttp://lodqa.org/vocabulary/sort_of\u003e) \n  \n Score: 0.8333333333333334",
          "creator": "rocknrole"
        }
      ]
    }
  ]
}